{
  "vocab": [
    "!",
    "\"",
    "%",
    "(",
    ")",
    "*",
    ",",
    "-",
    ".",
    "0",
    "1",
    "100",
    "101",
    "103",
    "104",
    "105",
    "109",
    "110",
    "113",
    "114",
    "116408220747180",
    "12217128617468",
    "124",
    "132",
    "139",
    "141",
    "144",
    "149",
    "16",
    "160",
    "161",
    "162",
    "166",
    "167",
    "169",
    "170",
    "173",
    "174",
    "176",
    "180",
    "180534752715909",
    "182026865303687",
    "183",
    "186",
    "187",
    "1920",
    "193",
    "195",
    "1950",
    "1956",
    "196",
    "1960",
    "1997",
    "2",
    "20",
    "2011",
    "2018",
    "2022",
    "202317441989797",
    "2024",
    "2025",
    "210",
    "214",
    "21782523819432",
    "221",
    "222",
    "223704078324662",
    "231",
    "235",
    "239498355231839",
    "24",
    "25",
    "260",
    "263",
    "268867767854094",
    "27",
    "27511106155614",
    "279",
    "281",
    "284",
    "287",
    "297",
    "299",
    "3",
    "301",
    "302510342981844",
    "306964927285541",
    "309",
    "31",
    "317",
    "326",
    "334994367151177",
    "349",
    "36",
    "368",
    "370",
    "388427826212564",
    "396149989412790",
    "4",
    "404",
    "435",
    "45",
    "458381292432054",
    "459",
    "460",
    "471",
    "474",
    "491052945526715",
    "498",
    "50",
    "519976083365425",
    "523287943596443",
    "536017171347722",
    "540",
    "54271062270595",
    "552",
    "56",
    "58",
    "59",
    "591188266110655",
    "6",
    "60",
    "618",
    "63",
    "633204867857765",
    "64",
    "7",
    "700248623908735",
    "705698704623453",
    "707893754307565",
    "709833362282846",
    "714438399521762",
    "715",
    "73",
    "75",
    "76",
    "8",
    "817554244772622",
    "82",
    "83",
    "833",
    "84",
    "845094228802671",
    "85528826310987",
    "86",
    "864028215131398",
    "87",
    "881197841151803",
    "896296610501687",
    "918530170297861",
    "95",
    "951250349699645",
    "951698731919902",
    "981275449333477",
    "99",
    ":",
    ";",
    "?",
    "@",
    "a",
    "abilities",
    "ability",
    "abnormal",
    "about",
    "abrupt",
    "absolute",
    "abstain",
    "abstains",
    "abstention",
    "abstract",
    "abstraction",
    "abundant",
    "academic",
    "accelerate",
    "accelerators",
    "accept",
    "acceptable",
    "acceptance",
    "accepted",
    "accepting",
    "access",
    "accessible",
    "accidental",
    "accidentally",
    "accompany",
    "account",
    "accountability",
    "accumulation",
    "accuracy",
    "accurate",
    "achieve",
    "achieved",
    "achievements",
    "acknowledged",
    "acknowledging",
    "acl",
    "acquiring",
    "across",
    "act",
    "action",
    "actions",
    "activate",
    "activated",
    "activating",
    "activation",
    "activations",
    "active",
    "acts",
    "actual",
    "acute",
    "ad",
    "adam",
    "adamw",
    "adapt",
    "adaptability",
    "adaptation",
    "adapted",
    "adapter",
    "adapters",
    "adaptive",
    "adapts",
    "add",
    "added",
    "adding",
    "addition",
    "additional",
    "additions",
    "address",
    "addresses",
    "addressing",
    "adds",
    "adept",
    "adequately",
    "adherence",
    "adjacent",
    "adjust",
    "adjusting",
    "adjusts",
    "adopting",
    "adoption",
    "adults",
    "advanced",
    "advances",
    "advantage",
    "advantages",
    "adversarial",
    "advertised",
    "advice",
    "advise",
    "advisory",
    "aerial",
    "affect",
    "affective",
    "affects",
    "affidavit",
    "affordable",
    "africa",
    "african",
    "after",
    "against",
    "age",
    "agent",
    "agentic",
    "agents",
    "aggregate",
    "aggressive",
    "aggressively",
    "agi",
    "agreement",
    "agriculture",
    "ahead",
    "ai",
    "aid",
    "aids",
    "aim",
    "aims",
    "aires",
    "al",
    "alan",
    "algebra",
    "algorithm",
    "algorithmic",
    "algorithms",
    "alibi",
    "align",
    "aligned",
    "aligning",
    "alignment",
    "all",
    "alleviate",
    "allocate",
    "allocated",
    "allocation",
    "allocations",
    "allow",
    "allowed",
    "allowing",
    "allows",
    "alone",
    "along",
    "alongside",
    "already",
    "also",
    "alter",
    "alternative",
    "although",
    "altogether",
    "always",
    "ambiguity",
    "ambiguous",
    "america",
    "american",
    "among",
    "amortization",
    "amount",
    "amounts",
    "amplifies",
    "amplify",
    "an",
    "analogous",
    "analyse",
    "analyses",
    "analysing",
    "analysis",
    "analyze",
    "anchor",
    "ancient",
    "and",
    "ani",
    "annealing",
    "anomalous",
    "anomaly",
    "another",
    "answer",
    "answered",
    "answering",
    "answers",
    "ant",
    "anti",
    "any",
    "anywhere",
    "apart",
    "apek",
    "apis",
    "apostrophes",
    "apparent",
    "appeal",
    "appear",
    "appears",
    "application",
    "applications",
    "applied",
    "applies",
    "apply",
    "applying",
    "approach",
    "approached",
    "approaches",
    "appropriate",
    "appropriately",
    "approximate",
    "arbitrarily",
    "arbitrary",
    "architectural",
    "architecture",
    "architectures",
    "archive",
    "are",
    "area",
    "argue",
    "argued",
    "arguments",
    "arise",
    "arises",
    "arithmetic",
    "arms",
    "around",
    "arrivals",
    "arrive",
    "arrived",
    "art",
    "arthur",
    "articles",
    "artifact",
    "artifacts",
    "artificial",
    "artwork",
    "as",
    "asi",
    "asia",
    "asian",
    "ask",
    "asked",
    "asking",
    "aspect",
    "aspects",
    "assemble",
    "assembly",
    "assessment",
    "assessments",
    "asset",
    "assign",
    "assignments",
    "assist",
    "assistance",
    "assistant",
    "assistants",
    "assistive",
    "associated",
    "associates",
    "associations",
    "assume",
    "assuming",
    "assumption",
    "assumptions",
    "at",
    "atomic",
    "attack",
    "attacker",
    "attackers",
    "attacks",
    "attainable",
    "attempt",
    "attempting",
    "attempts",
    "attend",
    "attends",
    "attention",
    "attribute",
    "audiences",
    "audio",
    "audit",
    "audited",
    "audits",
    "augment",
    "augmentation",
    "augmented",
    "authenticity",
    "authoritative",
    "authors",
    "autocomplete",
    "automata",
    "automate",
    "automated",
    "automatically",
    "automating",
    "automation",
    "autonomous",
    "autonomously",
    "autonomy",
    "autoregressive",
    "availability",
    "available",
    "average",
    "averaged",
    "avoid",
    "avoidance",
    "avoiding",
    "avoids",
    "award",
    "aware",
    "awareness",
    "away",
    "back",
    "backbone",
    "backdoors",
    "backfire",
    "backpressure",
    "backpropagation",
    "backward",
    "baked",
    "balance",
    "balanced",
    "balancing",
    "bandwidth",
    "banners",
    "base",
    "based",
    "baseline",
    "baselines",
    "basic",
    "basis",
    "batch",
    "batches",
    "batching",
    "be",
    "beam",
    "because",
    "become",
    "becomes",
    "been",
    "before",
    "begin",
    "beginning",
    "begins",
    "behave",
    "behaves",
    "behavior",
    "behavioral",
    "behaviors",
    "behaviour",
    "behaviours",
    "being",
    "beings",
    "belief",
    "belongs",
    "benchmark",
    "benchmarking",
    "benchmarks",
    "beneficence",
    "beneficial",
    "benefit",
    "benefited",
    "benefits",
    "bengio",
    "benign",
    "best",
    "better",
    "between",
    "beyond",
    "bfloat",
    "bias",
    "biased",
    "biases",
    "bidirectional",
    "bigger",
    "billions",
    "bioinformatics",
    "biological",
    "bit",
    "bits",
    "blandness",
    "blend",
    "blends",
    "block",
    "blocked",
    "blocking",
    "blocks",
    "blog",
    "blood",
    "blue",
    "blurs",
    "bm",
    "body",
    "boilerplate",
    "books",
    "boolean",
    "boosts",
    "bootstrapped",
    "borderline",
    "borrows",
    "both",
    "bottleneck",
    "boundaries",
    "boundary",
    "bpe",
    "brain",
    "brains",
    "brakes",
    "branch",
    "branching",
    "brand",
    "breadth",
    "break",
    "breakthroughs",
    "briefly",
    "brittle",
    "broad",
    "broader",
    "broadly",
    "brute",
    "bubbles",
    "budget",
    "budgeting",
    "budgets",
    "buenos",
    "buffer",
    "bugs",
    "build",
    "builders",
    "building",
    "builds",
    "built",
    "bulk",
    "bullet",
    "burden",
    "business",
    "busy",
    "but",
    "by",
    "bypass",
    "byte",
    "bytes",
    "cache",
    "cached",
    "caches",
    "caching",
    "calculators",
    "calibrate",
    "calibrated",
    "calibration",
    "call",
    "called",
    "calling",
    "calls",
    "came",
    "can",
    "cancellation",
    "candidate",
    "candidates",
    "cannot",
    "canonical",
    "capabilities",
    "capability",
    "capable",
    "capacity",
    "capture",
    "captured",
    "captures",
    "capturing",
    "carbon",
    "card",
    "cards",
    "care",
    "career",
    "careful",
    "carefully",
    "caribbean",
    "carry",
    "carrying",
    "cars",
    "case",
    "cases",
    "casual",
    "catastrophic",
    "categories",
    "categorise",
    "categorised",
    "category",
    "causal",
    "causality",
    "cause",
    "caused",
    "causing",
    "caution",
    "cautioning",
    "cautiously",
    "caveats",
    "celebrated",
    "center",
    "central",
    "centuries",
    "century",
    "certain",
    "chain",
    "chaining",
    "challenge",
    "challenges",
    "challenging",
    "champion",
    "change",
    "changes",
    "changing",
    "channels",
    "character",
    "characterise",
    "characteristics",
    "characters",
    "chat",
    "chatbots",
    "chatgpt",
    "cheap",
    "cheaper",
    "checkers",
    "checking",
    "checkpoint",
    "checkpointing",
    "checkpoints",
    "checks",
    "chess",
    "chile",
    "chip",
    "chips",
    "choice",
    "choices",
    "choose",
    "chooses",
    "choosing",
    "chores",
    "chromosomes",
    "chunk",
    "chunking",
    "chunks",
    "citation",
    "citations",
    "cite",
    "cites",
    "claim",
    "claims",
    "clarifies",
    "clarify",
    "clarifying",
    "class",
    "classic",
    "classical",
    "classification",
    "classifiers",
    "classify",
    "claude",
    "clean",
    "cleaned",
    "cleaner",
    "cleaning",
    "cleanliness",
    "clear",
    "clearly",
    "client",
    "clipping",
    "clock",
    "close",
    "closely",
    "closer",
    "cloud",
    "cluster",
    "clustering",
    "clusters",
    "co",
    "coarse",
    "code",
    "coded",
    "codified",
    "coding",
    "coexist",
    "cognition",
    "cognitive",
    "coherence",
    "coherent",
    "coined",
    "cold",
    "collaborate",
    "collaborative",
    "collapse",
    "collect",
    "collected",
    "collecting",
    "collection",
    "collections",
    "college",
    "colloquial",
    "colony",
    "colours",
    "combination",
    "combine",
    "combined",
    "combines",
    "combining",
    "come",
    "comes",
    "commands",
    "comment",
    "commercial",
    "common",
    "commonly",
    "communicated",
    "communication",
    "compact",
    "companies",
    "comparable",
    "comparative",
    "compare",
    "compared",
    "comparing",
    "comparisons",
    "compatible",
    "compensate",
    "compete",
    "competence",
    "competencies",
    "competent",
    "competing",
    "competitive",
    "compile",
    "complement",
    "complementary",
    "complemented",
    "complements",
    "complete",
    "completion",
    "complex",
    "complexity",
    "compliance",
    "compliant",
    "complicate",
    "complicated",
    "complicates",
    "complied",
    "comply",
    "component",
    "components",
    "composed",
    "composition",
    "compositional",
    "compositionally",
    "compounding",
    "comprehend",
    "comprehensive",
    "compress",
    "compression",
    "compromise",
    "computation",
    "computational",
    "computations",
    "compute",
    "computed",
    "computer",
    "computers",
    "computes",
    "computing",
    "con",
    "concatenates",
    "concentrate",
    "concept",
    "concepts",
    "conceptual",
    "conceptually",
    "concern",
    "concerned",
    "concerns",
    "concise",
    "conclusion",
    "conclusions",
    "concrete",
    "concurrency",
    "concurrent",
    "concurrently",
    "condition",
    "conditional",
    "conditioned",
    "conditioning",
    "conditions",
    "conduct",
    "confabulating",
    "confabulations",
    "conference",
    "confidence",
    "confident",
    "confidential",
    "configurable",
    "confirm",
    "confirmation",
    "conflict",
    "conjure",
    "connect",
    "connecting",
    "connections",
    "connectivity",
    "connects",
    "consciousness",
    "consequence",
    "consequences",
    "consequently",
    "conservative",
    "consider",
    "consideration",
    "considerations",
    "considered",
    "considers",
    "consist",
    "consistency",
    "consistent",
    "consistently",
    "consists",
    "consolidation",
    "constrain",
    "constrained",
    "constrains",
    "constraint",
    "constraints",
    "construct",
    "constructing",
    "construction",
    "consume",
    "consumes",
    "consuming",
    "consumption",
    "contain",
    "contained",
    "containing",
    "contains",
    "contamination",
    "contemporary",
    "content",
    "context",
    "contexts",
    "contextual",
    "contiguous",
    "continually",
    "continuation",
    "continuations",
    "continue",
    "continued",
    "continues",
    "continuing",
    "continuous",
    "contract",
    "contracts",
    "contradict",
    "contradiction",
    "contradictory",
    "contrast",
    "contrasting",
    "contrasts",
    "contribute",
    "contributes",
    "contributions",
    "control",
    "controlled",
    "controlling",
    "controls",
    "conventional",
    "conventions",
    "convergence",
    "conversational",
    "converse",
    "conversely",
    "conversion",
    "convert",
    "converted",
    "converting",
    "converts",
    "convincing",
    "convolutional",
    "cookie",
    "cooling",
    "coordinated",
    "coordinates",
    "copies",
    "copying",
    "copyright",
    "copyrighted",
    "core",
    "cornell",
    "corpora",
    "corpus",
    "correct",
    "correction",
    "correctly",
    "correctness",
    "correlates",
    "correlations",
    "correspond",
    "corresponding",
    "corresponds",
    "corrupted",
    "corruption",
    "cosine",
    "cosmetic",
    "cost",
    "costs",
    "could",
    "count",
    "counterintuitive",
    "countries",
    "country",
    "counts",
    "coupled",
    "cover",
    "coverage",
    "covers",
    "crafted",
    "crafting",
    "crawl",
    "create",
    "created",
    "creates",
    "creating",
    "creative",
    "credit",
    "crisp",
    "critical",
    "critics",
    "crops",
    "cross",
    "crosses",
    "crossover",
    "crucial",
    "cues",
    "cuisine",
    "cultural",
    "culturally",
    "culture",
    "cumulative",
    "curate",
    "curated",
    "curating",
    "curation",
    "current",
    "curriculum",
    "curve",
    "customer",
    "cut",
    "cycle",
    "cycled",
    "cycles",
    "d",
    "dangerous",
    "dartmouth",
    "dashes",
    "data",
    "database",
    "databases",
    "datacentres",
    "dataset",
    "datasets",
    "date",
    "day",
    "de",
    "debate",
    "debug",
    "debugging",
    "decades",
    "decay",
    "deceptively",
    "decide",
    "decides",
    "decision",
    "decisions",
    "decline",
    "decoder",
    "decoding",
    "decomposes",
    "decontamination",
    "decoupled",
    "decoupling",
    "decrease",
    "decreases",
    "decreasing",
    "deduplicate",
    "deduplicated",
    "deduplication",
    "deep",
    "deeper",
    "deepfakes",
    "deepseek",
    "default",
    "defeating",
    "defect",
    "defence",
    "defense",
    "defenses",
    "define",
    "defined",
    "defines",
    "defining",
    "definition",
    "definitions",
    "definitive",
    "defuzzification",
    "degradation",
    "degrade",
    "degrades",
    "degrees",
    "delay",
    "delayed",
    "deliberate",
    "delicate",
    "deliver",
    "delivery",
    "demand",
    "demands",
    "democratise",
    "demographic",
    "demographics",
    "demonstrate",
    "demonstrated",
    "demonstrates",
    "demonstrating",
    "dense",
    "density",
    "dependence",
    "dependencies",
    "dependency",
    "dependent",
    "depending",
    "depends",
    "deploy",
    "deployed",
    "deploying",
    "deployment",
    "deployments",
    "depression",
    "depth",
    "derive",
    "derived",
    "describe",
    "described",
    "describes",
    "describing",
    "description",
    "descriptions",
    "descriptive",
    "design",
    "designed",
    "designing",
    "designs",
    "desirable",
    "desired",
    "despite",
    "destabilize",
    "destructive",
    "detail",
    "detailed",
    "details",
    "detect",
    "detecting",
    "detection",
    "detector",
    "detectors",
    "detects",
    "determine",
    "determines",
    "determinism",
    "deterministic",
    "deterministically",
    "detokenization",
    "develop",
    "developed",
    "developer",
    "developers",
    "developing",
    "development",
    "developments",
    "develops",
    "deviate",
    "device",
    "devices",
    "diagnose",
    "diagnoses",
    "diagnosis",
    "diagnostics",
    "dialect",
    "dialectal",
    "dialogue",
    "did",
    "didactic",
    "differ",
    "difference",
    "differences",
    "different",
    "differentiates",
    "differently",
    "differs",
    "difficult",
    "difficulty",
    "diffuse",
    "digital",
    "dimension",
    "dimensional",
    "dimensionality",
    "dimensions",
    "diminish",
    "diminishes",
    "diminishing",
    "dioxide",
    "direct",
    "directions",
    "directives",
    "directly",
    "disallowed",
    "disambiguate",
    "disaster",
    "discard",
    "discarding",
    "discipline",
    "disciplined",
    "disciplines",
    "disclosing",
    "disclosure",
    "disconnect",
    "discourse",
    "discover",
    "discovered",
    "discovers",
    "discrete",
    "discriminatory",
    "discussed",
    "discussions",
    "diseases",
    "disillusionment",
    "disparities",
    "displace",
    "displacement",
    "disproportionate",
    "disproportionately",
    "dissipated",
    "distance",
    "distant",
    "distinct",
    "distinction",
    "distinctions",
    "distinguish",
    "distinguishes",
    "distinguishing",
    "distort",
    "distracted",
    "distribute",
    "distributed",
    "distributing",
    "distribution",
    "distributions",
    "diverge",
    "divergence",
    "diverse",
    "diversification",
    "diversity",
    "do",
    "document",
    "documentation",
    "documented",
    "documenting",
    "documents",
    "does",
    "domain",
    "domains",
    "domestic",
    "dominant",
    "dominate",
    "dominated",
    "dominating",
    "don",
    "done",
    "dot",
    "doubling",
    "down",
    "downstream",
    "dozen",
    "dozens",
    "dpo",
    "draft",
    "drafts",
    "dramatically",
    "draw",
    "drift",
    "drive",
    "driven",
    "driver",
    "driving",
    "drones",
    "drop",
    "dropout",
    "drops",
    "drug",
    "drugs",
    "dual",
    "duality",
    "due",
    "duplicate",
    "duplicated",
    "duplicates",
    "duplicating",
    "duplication",
    "during",
    "dynamic",
    "dynamically",
    "dynamics",
    "e",
    "each",
    "earlier",
    "early",
    "earth",
    "easily",
    "easy",
    "economically",
    "economics",
    "ecosystem",
    "edge",
    "edges",
    "edited",
    "editing",
    "edits",
    "education",
    "educational",
    "educators",
    "effect",
    "effective",
    "effectively",
    "effectiveness",
    "effects",
    "efficiency",
    "efficient",
    "efficiently",
    "efforts",
    "either",
    "electrical",
    "electricity",
    "elicit",
    "eliciting",
    "eligible",
    "eliminate",
    "eliza",
    "email",
    "emails",
    "embed",
    "embedded",
    "embedding",
    "embeddings",
    "embodied",
    "emerged",
    "emergence",
    "emerges",
    "emerging",
    "emissions",
    "emit",
    "emotion",
    "emotional",
    "emotions",
    "empathetic",
    "emphasis",
    "emphasise",
    "emphasises",
    "emphasising",
    "emphasize",
    "emphasizes",
    "emphasizing",
    "empirical",
    "employ",
    "empower",
    "empowers",
    "emulate",
    "enable",
    "enabled",
    "enables",
    "enabling",
    "encode",
    "encoded",
    "encoder",
    "encodes",
    "encoding",
    "encodings",
    "encompasses",
    "encourage",
    "encouraged",
    "encourages",
    "encouraging",
    "encyclopedia",
    "end",
    "ended",
    "endowed",
    "energy",
    "enforce",
    "enforced",
    "enforcement",
    "enforces",
    "enforcing",
    "engine",
    "engineering",
    "engineers",
    "engines",
    "english",
    "enhance",
    "enhancing",
    "enough",
    "ensure",
    "ensuring",
    "entered",
    "enterprise",
    "entire",
    "entirely",
    "entities",
    "entity",
    "entropy",
    "entry",
    "environment",
    "environmental",
    "environmentally",
    "environments",
    "epochs",
    "equal",
    "equally",
    "equate",
    "equates",
    "equips",
    "equitable",
    "equivalence",
    "equivalent",
    "erosion",
    "error",
    "errors",
    "especially",
    "essays",
    "essential",
    "establishing",
    "estimate",
    "estimates",
    "estimation",
    "ethical",
    "ethics",
    "ethnicities",
    "evaluate",
    "evaluated",
    "evaluates",
    "evaluating",
    "evaluation",
    "evaluations",
    "evaluator",
    "evaporative",
    "even",
    "evenly",
    "events",
    "eventually",
    "every",
    "everyday",
    "everything",
    "evidence",
    "evolve",
    "evolves",
    "exacerbate",
    "exacerbating",
    "exact",
    "exactness",
    "examination",
    "examine",
    "example",
    "examples",
    "exceed",
    "exceeded",
    "exceeds",
    "excel",
    "excels",
    "except",
    "excessive",
    "executes",
    "executing",
    "execution",
    "exfiltration",
    "exhibit",
    "exhibits",
    "exist",
    "existing",
    "exists",
    "expand",
    "expect",
    "expectations",
    "expected",
    "expend",
    "expensive",
    "experience",
    "experiences",
    "experiment",
    "experimental",
    "experimentation",
    "experimenting",
    "experiments",
    "expert",
    "expertise",
    "experts",
    "explain",
    "explaining",
    "explains",
    "explanation",
    "explanations",
    "explanatory",
    "explicability",
    "explicit",
    "explicitly",
    "exploding",
    "exploit",
    "exploitation",
    "exploited",
    "exploration",
    "explore",
    "explored",
    "explores",
    "exploring",
    "expose",
    "exposing",
    "exposition",
    "exposure",
    "express",
    "expressions",
    "expressivity",
    "extend",
    "extended",
    "extends",
    "external",
    "extra",
    "extract",
    "extracted",
    "extraction",
    "extrapolation",
    "extreme",
    "extremely",
    "extrinsic",
    "fabricate",
    "fabricated",
    "fabrication",
    "face",
    "facial",
    "facilitating",
    "facing",
    "fact",
    "factor",
    "factories",
    "factorizes",
    "facts",
    "factual",
    "factuality",
    "factually",
    "fail",
    "failing",
    "fails",
    "failure",
    "failures",
    "fair",
    "fairness",
    "faithfulness",
    "fall",
    "false",
    "falsehoods",
    "falter",
    "families",
    "family",
    "fast",
    "faster",
    "fault",
    "favors",
    "favour",
    "fear",
    "feasibility",
    "feasible",
    "feature",
    "features",
    "feed",
    "feedback",
    "feedforward",
    "feels",
    "few",
    "fewer",
    "field",
    "fields",
    "figures",
    "files",
    "filter",
    "filtered",
    "filtering",
    "filters",
    "final",
    "finance",
    "financial",
    "find",
    "finding",
    "findings",
    "finds",
    "fine",
    "finished",
    "finite",
    "firms",
    "first",
    "fit",
    "fitness",
    "fits",
    "fitter",
    "five",
    "fixed",
    "flag",
    "flagged",
    "flashattention",
    "flaw",
    "flawed",
    "flexibility",
    "flexible",
    "float",
    "floating",
    "flops",
    "flow",
    "fluency",
    "fluent",
    "focus",
    "focused",
    "focuses",
    "focusing",
    "follow",
    "followed",
    "following",
    "follows",
    "foolproof",
    "footers",
    "footprint",
    "for",
    "force",
    "forced",
    "forecasting",
    "forecasts",
    "forget",
    "forgetting",
    "forgotten",
    "form",
    "formal",
    "formalised",
    "format",
    "formats",
    "formatted",
    "formatting",
    "formed",
    "forming",
    "forms",
    "forums",
    "forward",
    "found",
    "foundation",
    "foundational",
    "foundations",
    "founded",
    "four",
    "fox",
    "fraction",
    "fragile",
    "fragmentation",
    "fragmented",
    "fragments",
    "frames",
    "framework",
    "frameworks",
    "framing",
    "fraud",
    "free",
    "freezing",
    "frequencies",
    "frequency",
    "frequent",
    "frequently",
    "freshness",
    "friendly",
    "from",
    "front",
    "frontier",
    "full",
    "fully",
    "function",
    "functional",
    "functionality",
    "functionally",
    "functions",
    "fundamental",
    "fundamentals",
    "furniture",
    "further",
    "fuse",
    "fusing",
    "fusion",
    "future",
    "fuzzification",
    "fuzzy",
    "g",
    "gains",
    "game",
    "games",
    "gap",
    "gaps",
    "garry",
    "gate",
    "gated",
    "gates",
    "gather",
    "gating",
    "gauging",
    "gaussian",
    "gco",
    "gemini",
    "genders",
    "general",
    "generalise",
    "generality",
    "generalization",
    "generalize",
    "generally",
    "generate",
    "generated",
    "generates",
    "generating",
    "generation",
    "generations",
    "generative",
    "generator",
    "generic",
    "genetic",
    "genetics",
    "genre",
    "genres",
    "genuine",
    "genuinely",
    "geoffrey",
    "geometric",
    "geometry",
    "gesture",
    "get",
    "give",
    "given",
    "gives",
    "giving",
    "global",
    "glyphs",
    "go",
    "goal",
    "goes",
    "good",
    "google",
    "governance",
    "governments",
    "gpt",
    "gpu",
    "gradient",
    "gradients",
    "gradually",
    "grained",
    "gram",
    "grammar",
    "grams",
    "graphs",
    "grassroots",
    "greatly",
    "greedy",
    "greener",
    "greenwashing",
    "grid",
    "grok",
    "ground",
    "grounded",
    "grounding",
    "groundwork",
    "grouped",
    "grouping",
    "groupings",
    "groups",
    "grow",
    "grows",
    "growth",
    "guarantee",
    "guarantees",
    "guardrails",
    "guess",
    "guessing",
    "guidance",
    "guide",
    "guidelines",
    "guides",
    "guiding",
    "hacking",
    "hallmark",
    "hallucinate",
    "hallucination",
    "hallucinations",
    "hand",
    "handcrafted",
    "handle",
    "handled",
    "handles",
    "handling",
    "happen",
    "happened",
    "harbour",
    "hard",
    "harder",
    "hardware",
    "harm",
    "harmful",
    "harmlessness",
    "harnessed",
    "harvest",
    "has",
    "hashing",
    "hate",
    "have",
    "hazardous",
    "head",
    "headers",
    "headline",
    "heads",
    "health",
    "healthcare",
    "heat",
    "heavily",
    "heavy",
    "hedges",
    "helm",
    "help",
    "helpful",
    "helpfulness",
    "helps",
    "here",
    "heuristic",
    "heuristics",
    "hidden",
    "hide",
    "hierarchical",
    "hierarchies",
    "hierarchy",
    "high",
    "higher",
    "highest",
    "highlight",
    "highlighting",
    "highlights",
    "highly",
    "hinton",
    "hiring",
    "historical",
    "historically",
    "history",
    "hit",
    "hoc",
    "holding",
    "holds",
    "holistic",
    "honest",
    "honesty",
    "hooks",
    "hot",
    "hours",
    "household",
    "how",
    "however",
    "html",
    "huge",
    "human",
    "humanities",
    "humans",
    "hybrid",
    "hygiene",
    "hyperparameters",
    "i",
    "ibm",
    "idea",
    "ideal",
    "idealised",
    "ideas",
    "identical",
    "identifiable",
    "identifiers",
    "identifies",
    "identify",
    "identifying",
    "identities",
    "ideologies",
    "ideology",
    "ids",
    "if",
    "ignorance",
    "ignore",
    "ill",
    "illogical",
    "illustrate",
    "illustrates",
    "illustrating",
    "image",
    "images",
    "imagination",
    "imaging",
    "imbalance",
    "imbalanced",
    "immediate",
    "impact",
    "impactful",
    "impacts",
    "impair",
    "impartiality",
    "imperative",
    "imperfect",
    "implement",
    "implementation",
    "implementations",
    "implemented",
    "implementing",
    "implication",
    "implications",
    "implicit",
    "implicitly",
    "implied",
    "implying",
    "importance",
    "important",
    "impose",
    "imposed",
    "impossible",
    "imprecise",
    "impressive",
    "improve",
    "improved",
    "improvements",
    "improves",
    "improving",
    "in",
    "inadvertently",
    "incentivised",
    "incidents",
    "inclination",
    "include",
    "included",
    "includes",
    "including",
    "inclusion",
    "inclusive",
    "inclusivity",
    "incomplete",
    "inconsistencies",
    "inconsistent",
    "incorporate",
    "incorporates",
    "incorporating",
    "incorrect",
    "incorrectly",
    "increase",
    "increases",
    "increasing",
    "increasingly",
    "increment",
    "incremental",
    "independent",
    "index",
    "indexed",
    "indexing",
    "indian",
    "indicate",
    "indicates",
    "indicating",
    "indirect",
    "indirectly",
    "indiscriminately",
    "individual",
    "individuals",
    "induce",
    "induced",
    "industrial",
    "industries",
    "industry",
    "inefficient",
    "inefficiently",
    "infer",
    "inference",
    "infers",
    "infinite",
    "inflate",
    "inflated",
    "influence",
    "influenced",
    "influences",
    "inform",
    "informal",
    "information",
    "informed",
    "informs",
    "infrastructure",
    "infringe",
    "ingest",
    "ingestion",
    "inherent",
    "inherit",
    "initial",
    "initialization",
    "initiatives",
    "inject",
    "injected",
    "injection",
    "injects",
    "innovation",
    "input",
    "inputs",
    "insert",
    "inserted",
    "inserting",
    "inserts",
    "insights",
    "inspect",
    "inspection",
    "inspiration",
    "inspired",
    "instability",
    "instance",
    "instead",
    "instructed",
    "instructing",
    "instruction",
    "instructions",
    "instructors",
    "insufficient",
    "int",
    "intact",
    "integers",
    "integrate",
    "integrated",
    "integrates",
    "integration",
    "integrity",
    "intellect",
    "intelligence",
    "intelligent",
    "intelligently",
    "intended",
    "intensive",
    "intent",
    "intentions",
    "intents",
    "interact",
    "interacting",
    "interaction",
    "interactive",
    "interacts",
    "interconnected",
    "interdisciplinary",
    "interface",
    "interfaces",
    "interference",
    "intermediate",
    "intermittent",
    "internal",
    "internalize",
    "interplay",
    "interpret",
    "interpretability",
    "interpretable",
    "interpreting",
    "interventions",
    "into",
    "intrinsic",
    "introduce",
    "introduced",
    "introduces",
    "introducing",
    "introduction",
    "introductions",
    "intuitive",
    "invalid",
    "invalidation",
    "invariant",
    "invent",
    "invented",
    "invents",
    "invest",
    "investing",
    "investments",
    "invocation",
    "involve",
    "involved",
    "involves",
    "involving",
    "io",
    "irrelevant",
    "is",
    "isolate",
    "isolation",
    "issue",
    "issues",
    "it",
    "items",
    "iteration",
    "iterative",
    "its",
    "itself",
    "jailbreaking",
    "jailbreaks",
    "jeopardy",
    "job",
    "jobs",
    "json",
    "judgment",
    "judgments",
    "just",
    "justice",
    "justifications",
    "justify",
    "juxtapose",
    "juxtaposing",
    "k",
    "karel",
    "kasparov",
    "keep",
    "keeping",
    "keeps",
    "kernel",
    "kernels",
    "key",
    "keys",
    "keywords",
    "kind",
    "kl",
    "know",
    "knowing",
    "knowledge",
    "knowledgeable",
    "known",
    "knows",
    "kv",
    "l",
    "label",
    "labelled",
    "labels",
    "lack",
    "lacks",
    "laid",
    "landmark",
    "language",
    "languages",
    "large",
    "larger",
    "last",
    "latam",
    "late",
    "latency",
    "later",
    "latin",
    "law",
    "laws",
    "lawyers",
    "layer",
    "layered",
    "layers",
    "layout",
    "layouts",
    "lead",
    "leaderboard",
    "leaderboards",
    "leading",
    "leads",
    "leak",
    "leakage",
    "leaked",
    "leaks",
    "learn",
    "learned",
    "learner",
    "learners",
    "learning",
    "learns",
    "least",
    "leave",
    "leaves",
    "leaving",
    "lecun",
    "led",
    "left",
    "legal",
    "legislative",
    "legitimate",
    "lemmatisation",
    "lending",
    "length",
    "lengths",
    "lengthy",
    "lens",
    "less",
    "lesson",
    "lets",
    "level",
    "levels",
    "leverage",
    "leverages",
    "lexical",
    "lexicon",
    "library",
    "licensing",
    "lies",
    "life",
    "lifecycle",
    "lifetime",
    "light",
    "lighter",
    "lightly",
    "like",
    "likelihood",
    "likely",
    "limitation",
    "limitations",
    "limited",
    "limiting",
    "limits",
    "line",
    "linear",
    "linguistic",
    "linguistics",
    "links",
    "lion",
    "list",
    "literature",
    "little",
    "live",
    "lives",
    "llm",
    "llms",
    "load",
    "loaded",
    "local",
    "localisation",
    "locality",
    "localized",
    "locally",
    "located",
    "lock",
    "locomotion",
    "log",
    "logging",
    "logic",
    "logical",
    "logically",
    "logics",
    "logistics",
    "logits",
    "logs",
    "long",
    "longcrawl",
    "longer",
    "look",
    "looks",
    "loop",
    "loops",
    "lora",
    "lose",
    "loses",
    "loss",
    "losses",
    "lossless",
    "lost",
    "lotfi",
    "low",
    "lower",
    "lsh",
    "lstm",
    "lurk",
    "machine",
    "machinery",
    "machines",
    "made",
    "main",
    "maintain",
    "maintaining",
    "maintains",
    "maintenance",
    "make",
    "makes",
    "making",
    "malicious",
    "malpractice",
    "manage",
    "manageable",
    "managed",
    "management",
    "managing",
    "mandate",
    "mandates",
    "manipulate",
    "manipulated",
    "manipulating",
    "manipulation",
    "manner",
    "mantra",
    "manual",
    "manually",
    "manufacturing",
    "many",
    "map",
    "mapping",
    "maps",
    "mark",
    "markers",
    "marketed",
    "marketing",
    "markets",
    "markov",
    "markup",
    "mask",
    "masked",
    "masking",
    "mass",
    "massive",
    "match",
    "matched",
    "matches",
    "matching",
    "material",
    "materialized",
    "materializes",
    "materials",
    "math",
    "mathematical",
    "matrices",
    "matrix",
    "matter",
    "matters",
    "mature",
    "maximise",
    "maximises",
    "maximization",
    "maximize",
    "maximizing",
    "maximum",
    "may",
    "mdps",
    "mean",
    "meaning",
    "meaningful",
    "meanings",
    "means",
    "measure",
    "measured",
    "measurement",
    "measurements",
    "measures",
    "measuring",
    "mechanical",
    "mechanics",
    "mechanism",
    "mechanisms",
    "media",
    "medical",
    "medicine",
    "megawatt",
    "membership",
    "memories",
    "memorization",
    "memorize",
    "memorized",
    "memorizing",
    "memory",
    "memos",
    "mental",
    "menus",
    "merely",
    "merge",
    "merges",
    "metadata",
    "method",
    "methods",
    "metric",
    "metrics",
    "micro",
    "mid",
    "middle",
    "might",
    "mila",
    "milestones",
    "millions",
    "mimic",
    "mind",
    "minhash",
    "miniature",
    "minimal",
    "minimise",
    "minimizes",
    "minimum",
    "mining",
    "minor",
    "mirror",
    "mirrored",
    "mirrors",
    "misclassify",
    "misconceptions",
    "misguide",
    "misinform",
    "misinformation",
    "misinformative",
    "misinterpret",
    "mislead",
    "misleading",
    "misled",
    "miss",
    "missing",
    "mistaken",
    "misunderstandings",
    "misuse",
    "misused",
    "mit",
    "mitigate",
    "mitigated",
    "mitigation",
    "mitigations",
    "mix",
    "mixed",
    "mixes",
    "mixing",
    "mixture",
    "mixtures",
    "ml",
    "mmlu",
    "mobile",
    "model",
    "modeling",
    "modelled",
    "modelling",
    "models",
    "moderate",
    "moderation",
    "modern",
    "modes",
    "modest",
    "modified",
    "modifying",
    "modular",
    "modulate",
    "module",
    "modules",
    "moe",
    "moment",
    "moments",
    "monitor",
    "monitoring",
    "monolingual",
    "monopolizing",
    "montr",
    "more",
    "moreover",
    "morphology",
    "most",
    "mostly",
    "motion",
    "motivate",
    "motivated",
    "motivates",
    "motivation",
    "motors",
    "movement",
    "movements",
    "moves",
    "movies",
    "much",
    "multi",
    "multidimensional",
    "multilingual",
    "multimodal",
    "multiple",
    "multiplication",
    "multiplications",
    "multiplied",
    "multiply",
    "multiplying",
    "multitask",
    "music",
    "must",
    "mutation",
    "mythic",
    "myths",
    "n",
    "naive",
    "name",
    "names",
    "narrative",
    "narratives",
    "narrow",
    "narrower",
    "national",
    "natural",
    "naturally",
    "nature",
    "navigate",
    "navigation",
    "near",
    "nearest",
    "necessary",
    "need",
    "needed",
    "needs",
    "negative",
    "negatives",
    "neglect",
    "negligible",
    "neighbor",
    "network",
    "networks",
    "neural",
    "neuron",
    "neurons",
    "neutral",
    "neutrality",
    "neutralizing",
    "never",
    "nevertheless",
    "new",
    "next",
    "niche",
    "nlp",
    "no",
    "nodes",
    "noise",
    "noisy",
    "non",
    "nonetheless",
    "nonexistent",
    "nonlinear",
    "nonmaleficence",
    "nonsensical",
    "norm",
    "normal",
    "normalization",
    "normalize",
    "normalized",
    "normalizing",
    "normally",
    "norms",
    "not",
    "notable",
    "notably",
    "notation",
    "note",
    "nothing",
    "notions",
    "novels",
    "nuance",
    "nuanced",
    "nuances",
    "nucleus",
    "number",
    "numbers",
    "numeric",
    "numerical",
    "object",
    "objective",
    "objectives",
    "objects",
    "observability",
    "observable",
    "observations",
    "observe",
    "observed",
    "observes",
    "observing",
    "obtained",
    "occur",
    "occurs",
    "of",
    "off",
    "offensive",
    "offer",
    "offering",
    "offers",
    "offs",
    "offset",
    "offspring",
    "often",
    "older",
    "omit",
    "on",
    "once",
    "one",
    "ones",
    "ongoing",
    "online",
    "only",
    "oov",
    "opaque",
    "open",
    "opening",
    "openness",
    "operate",
    "operates",
    "operating",
    "operational",
    "operationally",
    "operations",
    "operator",
    "operators",
    "opponents",
    "opportunities",
    "optical",
    "optimal",
    "optimisation",
    "optimism",
    "optimization",
    "optimizations",
    "optimized",
    "optimizer",
    "optimizers",
    "optimizes",
    "optimizing",
    "or",
    "orchestrates",
    "orchestrator",
    "order",
    "ordering",
    "orders",
    "ordinary",
    "organisations",
    "organization",
    "organizations",
    "orientation",
    "oriented",
    "original",
    "originality",
    "other",
    "others",
    "otherwise",
    "out",
    "outcomes",
    "outlier",
    "outliers",
    "outlining",
    "outperform",
    "outperforming",
    "output",
    "outputs",
    "over",
    "overall",
    "overcome",
    "overconfident",
    "overemphasise",
    "overestimating",
    "overfit",
    "overfits",
    "overfitting",
    "overflow",
    "overhead",
    "overlap",
    "overlaps",
    "overloaded",
    "overlook",
    "overlooks",
    "overly",
    "override",
    "oversampled",
    "overshadows",
    "oversight",
    "oversimplified",
    "overtly",
    "overuses",
    "overwritten",
    "own",
    "p",
    "pack",
    "page",
    "pagedattention",
    "pages",
    "paging",
    "pair",
    "paired",
    "pairing",
    "pairs",
    "pairwise",
    "paper",
    "papers",
    "paradigms",
    "paradox",
    "paragraph",
    "paragraphs",
    "parallel",
    "parallelism",
    "parameter",
    "parameters",
    "paraphrase",
    "paraphrases",
    "parent",
    "parsers",
    "parsing",
    "part",
    "partial",
    "partially",
    "particle",
    "particularly",
    "partitioning",
    "partitions",
    "partly",
    "parts",
    "pass",
    "passage",
    "passages",
    "passes",
    "passing",
    "passive",
    "past",
    "path",
    "patient",
    "pattern",
    "patterns",
    "pause",
    "pay",
    "peak",
    "pedagogy",
    "peeking",
    "peft",
    "penalize",
    "penalized",
    "penalizing",
    "penalties",
    "penalty",
    "people",
    "per",
    "perceive",
    "perceived",
    "percentiles",
    "perception",
    "perform",
    "performance",
    "performing",
    "performs",
    "periodic",
    "periods",
    "permission",
    "permissioning",
    "permissions",
    "permissive",
    "permutation",
    "perplexity",
    "persist",
    "persistent",
    "personal",
    "personalise",
    "personalised",
    "personally",
    "perspective",
    "perspectives",
    "persuasive",
    "phase",
    "phases",
    "phenomena",
    "phenomenon",
    "phone",
    "photorealistic",
    "phrases",
    "phrasing",
    "physical",
    "physiology",
    "pick",
    "picture",
    "piece",
    "pieces",
    "pii",
    "pillar",
    "pioneers",
    "pipeline",
    "pipelines",
    "pitfall",
    "pitfalls",
    "pixel",
    "place",
    "placement",
    "places",
    "plan",
    "planning",
    "plateau",
    "platforms",
    "plausible",
    "play",
    "played",
    "playing",
    "plus",
    "pme",
    "point",
    "points",
    "poison",
    "poisoned",
    "poisoning",
    "policies",
    "policy",
    "policymakers",
    "pooling",
    "poor",
    "poorly",
    "popular",
    "population",
    "populations",
    "porotos",
    "portray",
    "portrayed",
    "pose",
    "posed",
    "position",
    "positional",
    "positioned",
    "positions",
    "positive",
    "positives",
    "possess",
    "possessed",
    "possibilities",
    "possible",
    "post",
    "posts",
    "potential",
    "potentially",
    "power",
    "powered",
    "powerful",
    "powering",
    "powers",
    "ppo",
    "practical",
    "practice",
    "practices",
    "practitioners",
    "pragmatic",
    "pre",
    "precedents",
    "precise",
    "precision",
    "predict",
    "predictability",
    "predictable",
    "predictably",
    "predicted",
    "predicting",
    "prediction",
    "predictions",
    "predictive",
    "predicts",
    "predominant",
    "predominantly",
    "preference",
    "preferences",
    "preferred",
    "prefix",
    "prefixes",
    "prejudices",
    "preliminary",
    "premises",
    "premium",
    "preparation",
    "prepared",
    "prescriptive",
    "present",
    "presented",
    "presenting",
    "presents",
    "preserve",
    "preserved",
    "preserves",
    "preserving",
    "pressure",
    "pressures",
    "presume",
    "pretrain",
    "pretrained",
    "pretraining",
    "prevailing",
    "prevent",
    "prevents",
    "previous",
    "primarily",
    "primary",
    "principle",
    "principles",
    "prior",
    "prioritise",
    "prioritize",
    "prioritizing",
    "priority",
    "privacy",
    "private",
    "privilege",
    "pro",
    "probabilistic",
    "probabilistically",
    "probabilities",
    "probability",
    "probable",
    "probes",
    "problem",
    "problems",
    "procedure",
    "procedures",
    "proceed",
    "process",
    "processed",
    "processes",
    "processing",
    "produce",
    "produced",
    "produces",
    "producing",
    "product",
    "production",
    "productivity",
    "products",
    "professionals",
    "professions",
    "profile",
    "profiling",
    "program",
    "programmed",
    "programming",
    "programs",
    "progress",
    "projection",
    "projections",
    "projects",
    "prominent",
    "promise",
    "promises",
    "promote",
    "prompt",
    "prompted",
    "prompting",
    "promptly",
    "prompts",
    "prone",
    "propagate",
    "propagation",
    "proper",
    "properties",
    "property",
    "proponents",
    "proportional",
    "proposal",
    "proposals",
    "propose",
    "proposed",
    "propositions",
    "proprietary",
    "prose",
    "protect",
    "protections",
    "protestant",
    "protocol",
    "protocols",
    "proven",
    "provenance",
    "provide",
    "provided",
    "providers",
    "provides",
    "providing",
    "proving",
    "proximal",
    "prune",
    "psychology",
    "public",
    "publications",
    "publicly",
    "publish",
    "punctuation",
    "pure",
    "purely",
    "purpose",
    "pursue",
    "q",
    "qa",
    "quadratic",
    "qualified",
    "qualitative",
    "quality",
    "quantitative",
    "quantity",
    "quantization",
    "quantized",
    "quantizing",
    "queries",
    "query",
    "querying",
    "quest",
    "question",
    "questioning",
    "questions",
    "queueing",
    "quickly",
    "r",
    "radio",
    "rag",
    "raise",
    "raises",
    "raising",
    "random",
    "randomly",
    "randomness",
    "range",
    "ranges",
    "ranging",
    "rank",
    "ranking",
    "rankings",
    "rapid",
    "rare",
    "rate",
    "rates",
    "rather",
    "ratings",
    "rationalizations",
    "raw",
    "re",
    "reach",
    "reached",
    "reaching",
    "react",
    "reactive",
    "read",
    "readable",
    "reading",
    "reads",
    "ready",
    "real",
    "realising",
    "realistic",
    "reality",
    "reason",
    "reasoning",
    "reasons",
    "recall",
    "recalling",
    "receive",
    "received",
    "receives",
    "receiving",
    "recency",
    "recent",
    "recipes",
    "recognise",
    "recognising",
    "recognition",
    "recognize",
    "recommend",
    "recommendation",
    "recommendations",
    "recommender",
    "recommending",
    "recomputation",
    "recompute",
    "recomputed",
    "recomputes",
    "reconcile",
    "reconstruction",
    "record",
    "recording",
    "records",
    "recover",
    "recurrent",
    "recurring",
    "red",
    "reduce",
    "reduced",
    "reduces",
    "reducing",
    "reduction",
    "redundant",
    "reference",
    "references",
    "refers",
    "refine",
    "refining",
    "reflect",
    "reflecting",
    "reflects",
    "reframe",
    "reframes",
    "refusal",
    "refusals",
    "refuse",
    "refuses",
    "regardless",
    "regimes",
    "region",
    "regional",
    "regions",
    "regression",
    "regressions",
    "regularization",
    "regulated",
    "regulation",
    "regulations",
    "reinforce",
    "reinforcement",
    "reinforces",
    "reinforcing",
    "reiterating",
    "reject",
    "rejected",
    "rejecting",
    "rejection",
    "related",
    "relationship",
    "relationships",
    "relative",
    "relatively",
    "relay",
    "release",
    "relevance",
    "relevant",
    "reliability",
    "reliable",
    "reliably",
    "reliance",
    "relied",
    "relies",
    "rely",
    "relying",
    "remain",
    "remaining",
    "remains",
    "remediate",
    "remedy",
    "remember",
    "remembering",
    "remind",
    "reminding",
    "reminds",
    "reminiscent",
    "remote",
    "removal",
    "remove",
    "removed",
    "removes",
    "removing",
    "render",
    "renewable",
    "reorganizes",
    "repeat",
    "repeated",
    "repeatedly",
    "repeats",
    "repetition",
    "repetitions",
    "repetitive",
    "replace",
    "replacements",
    "replicate",
    "replicates",
    "report",
    "reported",
    "reporting",
    "reports",
    "repositories",
    "represent",
    "representation",
    "representational",
    "representations",
    "representative",
    "represented",
    "representing",
    "represents",
    "reproduce",
    "reproduced",
    "reproducibility",
    "reproducible",
    "reproducing",
    "repurposed",
    "request",
    "requesting",
    "requests",
    "require",
    "required",
    "requirements",
    "requires",
    "requiring",
    "rescales",
    "research",
    "researchers",
    "resemble",
    "reservation",
    "reserved",
    "reserving",
    "residual",
    "residue",
    "resist",
    "resolution",
    "resource",
    "resources",
    "respect",
    "respected",
    "respond",
    "responding",
    "response",
    "responses",
    "responsible",
    "responsibly",
    "responsiveness",
    "restarting",
    "restricts",
    "restructuring",
    "result",
    "resulting",
    "results",
    "resume",
    "retraining",
    "retrieval",
    "retrieve",
