{
  "vocab": [
    "(",
    ")",
    ",",
    "-",
    ".",
    "100",
    "16",
    "25",
    "4",
    "8",
    ":",
    ";",
    "?",
    "@",
    "a",
    "ability",
    "abnormal",
    "about",
    "abrupt",
    "absolute",
    "abstain",
    "abstains",
    "abstention",
    "abstract",
    "academic",
    "accelerate",
    "accelerators",
    "accept",
    "acceptable",
    "acceptance",
    "accepted",
    "accepting",
    "access",
    "accessible",
    "accidental",
    "accidentally",
    "accumulation",
    "accuracy",
    "accurate",
    "achieve",
    "across",
    "act",
    "action",
    "actions",
    "activate",
    "activating",
    "activation",
    "activations",
    "active",
    "acts",
    "actual",
    "ad",
    "adam",
    "adamw",
    "adapt",
    "adaptation",
    "adapted",
    "adapter",
    "adapters",
    "adapts",
    "add",
    "added",
    "adding",
    "addition",
    "additional",
    "additions",
    "addresses",
    "adds",
    "adherence",
    "adjacent",
    "adjust",
    "advances",
    "advantage",
    "advantages",
    "adversarial",
    "advice",
    "affect",
    "affects",
    "affordable",
    "after",
    "against",
    "agent",
    "agentic",
    "agents",
    "aggregate",
    "aggressive",
    "aggressively",
    "agreement",
    "aim",
    "aims",
    "algorithm",
    "algorithms",
    "align",
    "aligned",
    "aligning",
    "alignment",
    "all",
    "allocate",
    "allocated",
    "allocation",
    "allocations",
    "allow",
    "allowed",
    "allowing",
    "allows",
    "alone",
    "alongside",
    "also",
    "alternative",
    "although",
    "always",
    "ambiguous",
    "among",
    "amortization",
    "amount",
    "amounts",
    "amplify",
    "an",
    "analogous",
    "analysis",
    "analyze",
    "anchor",
    "and",
    "anomalous",
    "another",
    "answer",
    "answering",
    "answers",
    "any",
    "apis",
    "apostrophes",
    "appeal",
    "appear",
    "appears",
    "application",
    "applications",
    "applied",
    "applies",
    "apply",
    "applying",
    "approach",
    "approached",
    "approaches",
    "appropriate",
    "appropriately",
    "approximate",
    "arbitrary",
    "architectural",
    "architecture",
    "architectures",
    "are",
    "arguments",
    "arise",
    "arises",
    "arithmetic",
    "around",
    "arrivals",
    "arrive",
    "articles",
    "artifact",
    "artifacts",
    "artificial",
    "as",
    "ask",
    "asked",
    "asking",
    "assembly",
    "asset",
    "assign",
    "assistance",
    "assistant",
    "associated",
    "associations",
    "assumptions",
    "at",
    "atomic",
    "attack",
    "attacker",
    "attackers",
    "attainable",
    "attempt",
    "attempting",
    "attempts",
    "attend",
    "attends",
    "attention",
    "attribute",
    "audit",
    "audited",
    "audits",
    "augmentation",
    "augmented",
    "automated",
    "automatically",
    "autoregressive",
    "available",
    "average",
    "averaged",
    "avoid",
    "avoidance",
    "avoiding",
    "avoids",
    "aware",
    "awareness",
    "back",
    "backdoors",
    "backpressure",
    "backpropagation",
    "backward",
    "balance",
    "balanced",
    "balancing",
    "bandwidth",
    "banners",
    "base",
    "based",
    "baseline",
    "basic",
    "basis",
    "batch",
    "batches",
    "batching",
    "be",
    "beam",
    "because",
    "become",
    "becomes",
    "been",
    "before",
    "begin",
    "begins",
    "behave",
    "behaves",
    "behavior",
    "behavioral",
    "behaviors",
    "being",
    "benchmark",
    "benchmarking",
    "benchmarks",
    "beneficial",
    "benefit",
    "benefits",
    "benign",
    "best",
    "better",
    "between",
    "beyond",
    "bfloat",
    "bias",
    "biased",
    "biases",
    "bidirectional",
    "bit",
    "bits",
    "blandness",
    "blend",
    "blends",
    "block",
    "blocked",
    "blocking",
    "blocks",
    "blog",
    "bm",
    "boilerplate",
    "books",
    "bootstrapped",
    "borderline",
    "borrows",
    "both",
    "bottleneck",
    "boundaries",
    "boundary",
    "bpe",
    "branching",
    "breadth",
    "break",
    "briefly",
    "brittle",
    "broad",
    "broader",
    "broadly",
    "brute",
    "bubbles",
    "budget",
    "budgeting",
    "budgets",
    "buffer",
    "bugs",
    "build",
    "builders",
    "building",
    "builds",
    "bulk",
    "bullet",
    "burden",
    "busy",
    "but",
    "by",
    "bypass",
    "byte",
    "bytes",
    "cache",
    "cached",
    "caches",
    "caching",
    "calculators",
    "calibrate",
    "calibrated",
    "calibration",
    "call",
    "called",
    "calling",
    "calls",
    "came",
    "can",
    "cancellation",
    "candidate",
    "candidates",
    "cannot",
    "capabilities",
    "capability",
    "capacity",
    "capture",
    "capturing",
    "card",
    "cards",
    "care",
    "careful",
    "carefully",
    "carrying",
    "case",
    "cases",
    "casual",
    "catastrophic",
    "categories",
    "causal",
    "causality",
    "cause",
    "caused",
    "caution",
    "caveats",
    "central",
    "certain",
    "chain",
    "challenge",
    "challenges",
    "challenging",
    "change",
    "changes",
    "changing",
    "channels",
    "character",
    "characteristics",
    "characters",
    "chat",
    "cheap",
    "cheaper",
    "checking",
    "checkpoint",
    "checkpointing",
    "checkpoints",
    "checks",
    "chip",
    "choice",
    "choices",
    "choose",
    "chooses",
    "chunk",
    "chunking",
    "chunks",
    "citation",
    "citations",
    "cite",
    "cites",
    "claims",
    "clarifies",
    "clarify",
    "clarifying",
    "class",
    "classic",
    "classification",
    "classifiers",
    "clean",
    "cleaned",
    "cleaner",
    "cleaning",
    "clear",
    "clearly",
    "client",
    "clipping",
    "clock",
    "close",
    "closely",
    "cluster",
    "clustering",
    "clusters",
    "coarse",
    "code",
    "coding",
    "coexist",
    "coherence",
    "coherent",
    "cold",
    "collapse",
    "collect",
    "collected",
    "collecting",
    "collection",
    "collections",
    "combination",
    "combine",
    "combined",
    "combines",
    "combining",
    "come",
    "commands",
    "comment",
    "common",
    "commonly",
    "communicated",
    "communication",
    "compact",
    "compare",
    "compared",
    "comparing",
    "comparisons",
    "compensate",
    "competence",
    "competencies",
    "competitive",
    "complement",
    "complementary",
    "complemented",
    "complements",
    "complete",
    "completion",
    "complex",
    "complexity",
    "compliance",
    "compliant",
    "complicates",
    "comply",
    "component",
    "components",
    "composition",
    "compositional",
    "compositionally",
    "compounding",
    "comprehensive",
    "compress",
    "compression",
    "compromise",
    "computation",
    "computational",
    "computations",
    "compute",
    "computed",
    "computes",
    "computing",
    "concatenates",
    "concentrate",
    "concept",
    "concepts",
    "conceptual",
    "conceptually",
    "concern",
    "concerned",
    "concerns",
    "concise",
    "conclusion",
    "conclusions",
    "concrete",
    "concurrency",
    "concurrent",
    "concurrently",
    "condition",
    "conditional",
    "conditioned",
    "conditioning",
    "conditions",
    "confidence",
    "confident",
    "configurable",
    "confirm",
    "connect",
    "connecting",
    "connections",
    "connectivity",
    "connects",
    "consequence",
    "consequences",
    "consequently",
    "conservative",
    "consider",
    "considerations",
    "considered",
    "considers",
    "consistency",
    "consistent",
    "consistently",
    "consists",
    "consolidation",
    "constrain",
    "constrained",
    "constrains",
    "constraint",
    "constraints",
    "construct",
    "construction",
    "consume",
    "consumes",
    "consuming",
    "consumption",
    "contain",
    "contains",
    "contamination",
    "contemporary",
    "content",
    "context",
    "contexts",
    "contextual",
    "contiguous",
    "continuation",
    "continuations",
    "continued",
    "continues",
    "continuous",
    "contract",
    "contracts",
    "contradict",
    "contradictory",
    "control",
    "controlled",
    "controlling",
    "controls",
    "conventions",
    "convergence",
    "conversational",
    "conversely",
    "conversion",
    "converting",
    "converts",
    "cookie",
    "copies",
    "copying",
    "copyright",
    "copyrighted",
    "core",
    "corpora",
    "corpus",
    "correct",
    "correctness",
    "correlates",
    "correspond",
    "corresponding",
    "corresponds",
    "corrupted",
    "corruption",
    "cosine",
    "cosmetic",
    "cost",
    "costs",
    "count",
    "counts",
    "coupled",
    "cover",
    "coverage",
    "crawl",
    "create",
    "created",
    "creates",
    "creating",
    "creative",
    "critical",
    "cross",
    "crucial",
    "cues",
    "culture",
    "cumulative",
    "curate",
    "curated",
    "curating",
    "curation",
    "curriculum",
    "curve",
    "customer",
    "dashes",
    "data",
    "database",
    "databases",
    "dataset",
    "datasets",
    "date",
    "debug",
    "debugging",
    "decay",
    "deceptively",
    "decide",
    "decides",
    "decision",
    "decisions",
    "decline",
    "decoder",
    "decoding",
    "decontamination",
    "decoupled",
    "decoupling",
    "decrease",
    "decreases",
    "decreasing",
    "deduplicate",
    "deduplicated",
    "deduplication",
    "deep",
    "deeper",
    "default",
    "defense",
    "defenses",
    "define",
    "defined",
    "defines",
    "defining",
    "definitions",
    "definitive",
    "degradation",
    "degrade",
    "degrades",
    "delay",
    "delayed",
    "deliberate",
    "delicate",
    "deliver",
    "demographic",
    "dense",
    "density",
    "dependence",
    "dependencies",
    "dependency",
    "dependent",
    "depending",
    "depends",
    "deploy",
    "deployed",
    "deploying",
    "deployment",
    "deployments",
    "derived",
    "describe",
    "described",
    "describes",
    "describing",
    "description",
    "design",
    "designed",
    "designing",
    "desired",
    "destabilize",
    "detail",
    "detailed",
    "details",
    "detect",
    "detecting",
    "detection",
    "detectors",
    "determine",
    "determines",
    "determinism",
    "deterministic",
    "deterministically",
    "detokenization",
    "developer",
    "developers",
    "development",
    "device",
    "devices",
    "diagnose",
    "diagnostics",
    "didactic",
    "differ",
    "difference",
    "differences",
    "different",
    "differentiates",
    "differently",
    "differs",
    "difficult",
    "diffuse",
    "dimension",
    "dimensional",
    "dimensionality",
    "dimensions",
    "diminish",
    "direct",
    "directives",
    "directly",
    "disallowed",
    "discard",
    "discipline",
    "disciplined",
    "disclosing",
    "disconnect",
    "discourse",
    "discrete",
    "discussed",
    "discussions",
    "distance",
    "distinct",
    "distinction",
    "distinctions",
    "distinguish",
    "distinguishing",
    "distort",
    "distribute",
    "distributed",
    "distribution",
    "distributions",
    "diverge",
    "divergence",
    "diverse",
    "diversity",
    "do",
    "document",
    "documentation",
    "documented",
    "documenting",
    "documents",
    "does",
    "domain",
    "domains",
    "dominant",
    "dominate",
    "dominated",
    "dominating",
    "don",
    "done",
    "dot",
    "doubling",
    "downstream",
    "dozen",
    "dpo",
    "draft",
    "drafts",
    "drift",
    "driven",
    "driver",
    "dropout",
    "due",
    "duplicate",
    "duplicated",
    "duplicates",
    "duplicating",
    "duplication",
    "during",
    "dynamic",
    "dynamically",
    "dynamics",
    "each",
    "earlier",
    "early",
    "easy",
    "economically",
    "economics",
    "ecosystem",
    "edge",
    "edited",
    "edits",
    "educational",
    "effective",
    "effectively",
    "effectiveness",
    "effects",
    "efficiency",
    "efficient",
    "efficiently",
    "elicit",
    "eliciting",
    "eligible",
    "emails",
    "embed",
    "embedded",
    "embedding",
    "embeddings",
    "emit",
    "emphasize",
    "emphasizes",
    "emphasizing",
    "empirical",
    "enable",
    "enables",
    "enabling",
    "encode",
    "encoded",
    "encoder",
    "encodes",
    "encoding",
    "encodings",
    "encourage",
    "encouraged",
    "encourages",
    "encyclopedia",
    "end",
    "ended",
    "enforce",
    "enforced",
    "enforcement",
    "enforces",
    "enforcing",
    "engineering",
    "engineers",
    "english",
    "enough",
    "ensure",
    "enterprise",
    "entire",
    "entities",
    "entity",
    "entropy",
    "entry",
    "environments",
    "equally",
    "equivalent",
    "error",
    "errors",
    "especially",
    "essays",
    "essential",
    "estimate",
    "estimates",
    "estimation",
    "ethical",
    "evaluate",
    "evaluated",
    "evaluation",
    "evaluations",
    "evaluator",
    "even",
    "every",
    "everything",
    "evidence",
    "exact",
    "exactness",
    "examine",
    "example",
    "examples",
    "exceed",
    "exceeds",
    "excel",
    "except",
    "excessive",
    "executes",
    "executing",
    "execution",
    "exfiltration",
    "exist",
    "existing",
    "exists",
    "expect",
    "expectations",
    "expensive",
    "experience",
    "experiment",
    "experimental",
    "experimentation",
    "experiments",
    "expert",
    "experts",
    "explain",
    "explaining",
    "explains",
    "explanation",
    "explanations",
    "explanatory",
    "explicit",
    "explicitly",
    "exploding",
    "exploit",
    "exploited",
    "explores",
    "expose",
    "exposing",
    "exposition",
    "exposure",
    "express",
    "extend",
    "extends",
    "external",
    "extracted",
    "extraction",
    "extrapolation",
    "extremely",
    "extrinsic",
    "fabricated",
    "face",
    "facing",
    "fact",
    "factor",
    "factorizes",
    "facts",
    "factual",
    "factuality",
    "fail",
    "failing",
    "fails",
    "failure",
    "failures",
    "fairness",
    "faithfulness",
    "false",
    "families",
    "family",
    "fast",
    "faster",
    "fault",
    "favors",
    "feasibility",
    "feasible",
    "feature",
    "features",
    "feed",
    "feedback",
    "feels",
    "few",
    "fewer",
    "field",
    "files",
    "filter",
    "filtered",
    "filtering",
    "filters",
    "final",
    "find",
    "findings",
    "fine",
    "finished",
    "finite",
    "first",
    "fit",
    "fits",
    "fixed",
    "flashattention",
    "flexible",
    "float",
    "floating",
    "flops",
    "flow",
    "fluency",
    "fluent",
    "focus",
    "focused",
    "focuses",
    "focusing",
    "follow",
    "followed",
    "following",
    "follows",
    "foolproof",
    "footers",
    "footprint",
    "for",
    "force",
    "forgetting",
    "form",
    "format",
    "formats",
    "formatted",
    "formatting",
    "formed",
    "forming",
    "forms",
    "forums",
    "forward",
    "foundation",
    "foundational",
    "fraction",
    "fragmentation",
    "fragmented",
    "fragments",
    "frames",
    "framework",
    "frameworks",
    "framing",
    "free",
    "freezing",
    "frequencies",
    "frequency",
    "frequent",
    "frequently",
    "freshness",
    "friendly",
    "from",
    "front",
    "frontier",
    "full",
    "fully",
    "function",
    "functional",
    "functions",
    "fundamental",
    "fundamentals",
    "furniture",
    "further",
    "fuse",
    "fusing",
    "fusion",
    "future",
    "fuzzy",
    "gains",
    "gating",
    "general",
    "generalization",
    "generalize",
    "generally",
    "generate",
    "generated",
    "generates",
    "generating",
    "generation",
    "generations",
    "generator",
    "genre",
    "genres",
    "genuine",
    "genuinely",
    "geometry",
    "given",
    "gives",
    "giving",
    "global",
    "glyphs",
    "goal",
    "good",
    "governance",
    "gpu",
    "gradient",
    "gradients",
    "gradually",
    "grained",
    "gram",
    "greatly",
    "greedy",
    "ground",
    "grounded",
    "grounding",
    "grouping",
    "grow",
    "grows",
    "growth",
    "guarantee",
    "guarantees",
    "guardrails",
    "guess",
    "guessing",
    "guide",
    "guiding",
    "hacking",
    "hallucinate",
    "hallucination",
    "hallucinations",
    "hand",
    "handle",
    "handled",
    "handling",
    "happen",
    "happened",
    "harder",
    "hardware",
    "harm",
    "harmful",
    "harmlessness",
    "has",
    "hashing",
    "hate",
    "have",
    "head",
    "headers",
    "headline",
    "heads",
    "health",
    "heavily",
    "heavy",
    "helm",
    "help",
    "helpful",
    "helpfulness",
    "helps",
    "heuristic",
    "heuristics",
    "hidden",
    "hide",
    "hierarchy",
    "high",
    "higher",
    "highlighting",
    "highlights",
    "highly",
    "historically",
    "hit",
    "hoc",
    "holding",
    "holistic",
    "hooks",
    "how",
    "however",
    "html",
    "huge",
    "human",
    "humanities",
    "hybrid",
    "hygiene",
    "hyperparameters",
    "i",
    "idea",
    "identical",
    "identifiers",
    "identify",
    "identifying",
    "ids",
    "if",
    "ignore",
    "illustrates",
    "imbalanced",
    "impact",
    "impactful",
    "imperfect",
    "implement",
    "implementation",
    "implementations",
    "implemented",
    "implementing",
    "implication",
    "implications",
    "implicit",
    "implicitly",
    "importance",
    "important",
    "improve",
    "improved",
    "improvements",
    "improves",
    "improving",
    "in",
    "inadvertently",
    "incidents",
    "include",
    "included",
    "includes",
    "including",
    "inclusion",
    "inconsistent",
    "incorporate",
    "incorporates",
    "incorrect",
    "incorrectly",
    "increase",
    "increases",
    "increasing",
    "increasingly",
    "increment",
    "incremental",
    "independent",
    "index",
    "indexed",
    "indexing",
    "indicate",
    "indirectly",
    "indiscriminately",
    "individual",
    "induce",
    "induced",
    "inefficient",
    "inefficiently",
    "inference",
    "infers",
    "inflate",
    "inflated",
    "influence",
    "influenced",
    "influences",
    "inform",
    "informal",
    "information",
    "informed",
    "informs",
    "infrastructure",
    "ingest",
    "ingestion",
    "inherit",
    "initial",
    "initialization",
    "inject",
    "injected",
    "injection",
    "injects",
    "input",
    "inputs",
    "insert",
    "inserted",
    "inserts",
    "inspect",
    "inspection",
    "instability",
    "instead",
    "instruction",
    "instructions",
    "insufficient",
    "int",
    "integrate",
    "integrated",
    "integration",
    "integrity",
    "intelligence",
    "intended",
    "intensive",
    "intent",
    "intents",
    "interact",
    "interacting",
    "interaction",
    "interactive",
    "interacts",
    "interface",
    "interfaces",
    "interference",
    "intermediate",
    "intermittent",
    "internal",
    "interplay",
    "interpret",
    "interpretability",
    "interpretable",
    "into",
    "intrinsic",
    "introduce",
    "introduced",
    "introduces",
    "introducing",
    "introduction",
    "introductions",
    "intuitive",
    "invalid",
    "invalidation",
    "invariant",
    "invented",
    "invest",
    "invocation",
    "involves",
    "io",
    "irrelevant",
    "is",
    "isolate",
    "isolation",
    "issue",
    "issues",
    "it",
    "items",
    "iteration",
    "iterative",
    "its",
    "itself",
    "jailbreaks",
    "json",
    "judgments",
    "just",
    "justifications",
    "k",
    "keep",
    "keeping",
    "keeps",
    "kernel",
    "kernels",
    "key",
    "keys",
    "keywords",
    "kind",
    "kl",
    "know",
    "knowledge",
    "known",
    "knows",
    "kv",
    "label",
    "labels",
    "language",
    "languages",
    "large",
    "larger",
    "last",
    "late",
    "latency",
    "later",
    "law",
    "laws",
    "layer",
    "layers",
    "layout",
    "layouts",
    "lead",
    "leaderboard",
    "leading",
    "leak",
    "leakage",
    "leaked",
    "learn",
    "learned",
    "learning",
    "learns",
    "least",
    "leaves",
    "left",
    "legal",
    "legitimate",
    "length",
    "lengths",
    "lens",
    "less",
    "lesson",
    "lets",
    "level",
    "levels",
    "leverages",
    "lexical",
    "library",
    "licensing",
    "lifecycle",
    "lighter",
    "lightly",
    "like",
    "likelihood",
    "likely",
    "limitations",
    "limited",
    "limiting",
    "limits",
    "line",
    "linear",
    "linguistic",
    "linguistics",
    "links",
    "list",
    "little",
    "live",
    "llm",
    "llms",
    "load",
    "loaded",
    "local",
    "locality",
    "localized",
    "log",
    "logging",
    "logic",
    "logits",
    "logs",
    "long",
    "longer",
    "look",
    "looks",
    "loop",
    "loops",
    "lora",
    "lose",
    "loses",
    "loss",
    "losses",
    "lossless",
    "lost",
    "low",
    "lower",
    "lsh",
    "made",
    "main",
    "maintain",
    "maintains",
    "make",
    "makes",
    "making",
    "malicious",
    "manage",
    "managed",
    "management",
    "manual",
    "many",
    "map",
    "maps",
    "mark",
    "markers",
    "markup",
    "mask",
    "masked",
    "mass",
    "massive",
    "match",
    "matches",
    "matching",
    "material",
    "materialized",
    "materializes",
    "math",
    "mathematical",
    "matrices",
    "matrix",
    "matter",
    "matters",
    "maximization",
    "maximize",
    "maximizing",
    "maximum",
    "may",
    "meaning",
    "meaningful",
    "means",
    "measure",
    "measured",
    "measurement",
    "measurements",
    "measures",
    "measuring",
    "mechanics",
    "mechanism",
    "mechanisms",
    "medical",
    "memorization",
    "memorize",
    "memorizing",
    "memory",
    "menus",
    "merely",
    "merge",
    "merges",
    "metadata",
    "method",
    "methods",
    "metric",
    "metrics",
    "micro",
    "mid",
    "middle",
    "might",
    "minhash",
    "miniature",
    "minimal",
    "minimizes",
    "minimum",
    "minor",
    "mirrored",
    "mirrors",
    "misinformation",
    "misinterpret",
    "misleading",
    "missing",
    "mistaken",
    "misuse",
    "misused",
    "mitigation",
    "mitigations",
    "mix",
    "mixed",
    "mixes",
    "mixing",
    "mixture",
    "mixtures",
    "mmlu",
    "model",
    "modeling",
    "models",
    "moderate",
    "moderation",
    "modern",
    "modes",
    "modest",
    "modified",
    "modifying",
    "modular",
    "module",
    "modules",
    "moe",
    "moment",
    "moments",
    "monitor",
    "monitoring",
    "monolingual",
    "monopolizing",
    "more",
    "morphology",
    "most",
    "mostly",
    "motivate",
    "motivates",
    "motivation",
    "movement",
    "much",
    "multi",
    "multidimensional",
    "multilingual",
    "multiple",
    "multiplication",
    "multiplications",
    "multiply",
    "multiplying",
    "multitask",
    "must",
    "n",
    "naive",
    "name",
    "names",
    "narrative",
    "narrow",
    "narrower",
    "natural",
    "naturally",
    "nature",
    "navigation",
    "near",
    "nearest",
    "necessary",
    "need",
    "needed",
    "needs",
    "negative",
    "negatives",
    "neighbor",
    "network",
    "networks",
    "neural",
    "neutralizing",
    "never",
    "new",
    "next",
    "nlp",
    "no",
    "noise",
    "noisy",
    "non",
    "nonetheless",
    "norm",
    "normal",
    "normalization",
    "normalize",
    "normalized",
    "normalizing",
    "not",
    "notation",
    "nuance",
    "nuanced",
    "nucleus",
    "number",
    "numbers",
    "numeric",
    "numerical",
    "objective",
    "objectives",
    "observability",
    "observations",
    "observe",
    "observed",
    "obtained",
    "occur",
    "occurs",
    "of",
    "off",
    "offers",
    "often",
    "omit",
    "on",
    "once",
    "one",
    "ones",
    "ongoing",
    "only",
    "oov",
    "opaque",
    "open",
    "operate",
    "operating",
    "operational",
    "operationally",
    "operations",
    "operator",
    "operators",
    "opportunities",
    "optimal",
    "optimization",
    "optimizations",
    "optimized",
    "optimizer",
    "optimizers",
    "optimizes",
    "or",
    "orchestrates",
    "orchestrator",
    "order",
    "ordering",
    "orders",
    "ordinary",
    "organization",
    "organizations",
    "oriented",
    "original",
    "other",
    "others",
    "otherwise",
    "out",
    "outcomes",
    "outlier",
    "outliers",
    "output",
    "outputs",
    "over",
    "overall",
    "overconfident",
    "overfit",
    "overfits",
    "overfitting",
    "overflow",
    "overhead",
    "overlap",
    "overlaps",
    "overloaded",
    "overly",
    "override",
    "oversampled",
    "oversimplified",
    "overuses",
    "own",
    "p",
    "pack",
    "page",
    "pagedattention",
    "pages",
    "paging",
    "pair",
    "paired",
    "pairs",
    "pairwise",
    "papers",
    "paragraph",
    "paragraphs",
    "parallel",
    "parallelism",
    "parameter",
    "parameters",
    "paraphrase",
    "paraphrases",
    "parsers",
    "parsing",
    "part",
    "partial",
    "partially",
    "particularly",
    "partitioning",
    "partitions",
    "parts",
    "pass",
    "passage",
    "passive",
    "past",
    "path",
    "pattern",
    "patterns",
    "pause",
    "peak",
    "pedagogy",
    "peeking",
    "peft",
    "penalize",
    "penalized",
    "penalizing",
    "penalties",
    "penalty",
    "per",
    "perceive",
    "perceived",
    "percentiles",
    "perform",
    "performance",
    "performs",
    "periodic",
    "permission",
    "permissioning",
    "permissions",
    "permissive",
    "permutation",
    "perplexity",
    "persistent",
    "personal",
    "perspective",
    "persuasive",
    "phase",
    "phases",
    "phenomena",
    "phenomenon",
    "phone",
    "phrases",
    "phrasing",
    "pick",
    "pieces",
    "pillar",
    "pipeline",
    "pipelines",
    "pitfall",
    "pitfalls",
    "place",
    "placement",
    "plan",
    "planning",
    "plausible",
    "plus",
    "point",
    "poison",
    "poisoning",
    "policies",
    "policy",
    "poor",
    "poorly",
    "popular",
    "position",
    "positional",
    "positions",
    "positive",
    "positives",
    "possible",
    "post",
    "posts",
    "potentially",
    "power",
    "powerful",
    "ppo",
    "practical",
    "practice",
    "practices",
    "practitioners",
    "pragmatic",
    "pre",
    "precise",
    "precision",
    "predict",
    "predictable",
    "predicted",
    "predicting",
    "prediction",
    "predicts",
    "preference",
    "preferences",
    "preferred",
    "prefix",
    "prefixes",
    "premium",
    "preparation",
    "preserve",
    "preserved",
    "preserves",
    "preserving",
    "pressure",
    "pressures",
    "pretrain",
    "pretrained",
    "pretraining",
    "prevent",
    "prevents",
    "previous",
    "primarily",
    "primary",
    "principle",
    "principles",
    "prior",
    "prioritize",
    "prioritizing",
    "priority",
    "privacy",
    "private",
    "probabilistic",
    "probabilities",
    "probability",
    "probable",
    "probes",
    "problem",
    "problems",
    "procedures",
    "process",
    "processed",
    "processes",
    "processing",
    "produce",
    "produced",
    "produces",
    "producing",
    "product",
    "production",
    "products",
    "profile",
    "profiling",
    "projection",
    "projections",
    "projects",
    "prominent",
    "prompt",
    "prompting",
    "promptly",
    "prompts",
    "property",
    "proportional",
    "proposal",
    "proposals",
    "propose",
    "proposed",
    "proprietary",
    "prose",
    "protocol",
    "protocols",
    "provenance",
    "provide",
    "provided",
    "provides",
    "providing",
    "proximal",
    "public",
    "publicly",
    "publish",
    "punctuation",
    "pure",
    "purely",
    "purpose",
    "qa",
    "quadratic",
    "quality",
    "quantization",
    "quantized",
    "quantizing",
    "queries",
    "query",
    "question",
    "questions",
    "queueing",
    "quickly",
    "rag",
    "raises",
    "random",
    "randomness",
    "range",
    "ranges",
    "ranging",
    "rank",
    "ranking",
    "rankings",
    "rapid",
    "rare",
    "rate",
    "rates",
    "rather",
    "ratings",
    "rationalizations",
    "raw",
    "re",
    "reach",
    "reaching",
    "read",
    "readable",
    "reading",
    "reads",
    "ready",
    "real",
    "realistic",
    "reason",
    "reasoning",
    "reasons",
    "recall",
    "receive",
    "recipes",
    "recognition",
    "recomputation",
    "recompute",
    "recomputed",
    "recomputes",
    "record",
    "recording",
    "records",
    "recurrent",
    "recurring",
    "red",
    "reduce",
    "reduced",
    "reduces",
    "reducing",
    "redundant",
    "reference",
    "references",
    "refers",
    "reflect",
    "reflects",
    "reframe",
    "reframes",
    "refusal",
    "refusals",
    "refuse",
    "refuses",
    "regardless",
    "regimes",
    "region",
    "regressions",
    "regularization",
    "reinforce",
    "reinforcement",
    "reinforcing",
    "reject",
    "rejected",
    "rejecting",
    "related",
    "relationship",
    "relationships",
    "relative",
    "relatively",
    "release",
    "relevant",
    "reliability",
    "reliable",
    "reliably",
    "relies",
    "rely",
    "relying",
    "remain",
    "remaining",
    "remains",
    "remediate",
    "removal",
    "remove",
    "removed",
    "removes",
    "removing",
    "reorganizes",
    "repeat",
    "repeated",
    "repeatedly",
    "repeats",
    "repetition",
    "repetitive",
    "replicates",
    "report",
    "reporting",
    "reports",
    "repositories",
    "represent",
    "representation",
    "representational",
    "representations",
    "representative",
    "represented",
    "representing",
    "represents",
    "reproduce",
    "reproduced",
    "reproducibility",
    "reproducible",
    "request",
    "requesting",
    "requests",
    "require",
    "required",
    "requirements",
    "requires",
    "requiring",
    "rescales",
    "research",
    "resemble",
    "reservation",
    "reserved",
    "reserving",
    "residual",
    "residue",
    "resolution",
    "resource",
    "resources",
    "respect",
    "respond",
    "response",
    "responses",
    "responsible",
    "responsiveness",
    "restarting",
    "restricts",
    "restructuring",
    "result",
    "resulting",
    "results",
    "resume",
    "retraining",
    "retrieval",
    "retrieve",
    "retrieved",
    "retrieves",
    "retry",
    "return",
    "returned",
    "returns",
    "reusable",
    "reuse",
    "reused",
    "reusing",
    "reveal",
    "revealing",
    "reveals",
    "review",
    "reviewed",
    "reviews",
    "revise",
    "reward",
    "rewards",
    "rewrite",
    "rewriting",
    "rich",
    "right",
    "rigor",
    "risk",
    "risks",
    "risky",
    "rlhf",
    "robust",
    "robustness",
    "role",
    "roleplay",
    "roles",
    "rope",
    "rotary",
    "rotation",
    "rotations",
    "route",
    "routes",
    "routing",
    "rule",
    "rules",
    "run",
    "runnable",
    "runs",
    "s",
    "safe",
    "safely",
    "safer",
    "safety",
    "same",
    "sample",
    "samples",
    "sampling",
    "sanitization",
    "satisfaction",
    "saving",
    "savings",
    "say",
    "scalable",
    "scale",
    "scaled",
    "scales",
    "scaling",
    "scenarios",
    "schedule",
    "schedules",
    "scheduling",
    "schema",
    "schemas",
    "scientific",
    "scoped",
    "scoping",
    "score",
    "scores",
    "scoring",
    "scrape",
    "scraping",
    "script",
    "scripts",
    "search",
    "searchable",
    "second",
    "secrets",
    "sections",
    "security",
    "see",
    "seeds",
    "seeks",
    "seen",
    "sees",
    "segment",
    "segmentation",
    "segmentations",
    "segments",
    "select",
    "selecting",
    "selects",
    "self",
    "semantic",
    "semantically",
    "semantics",
    "sense",
    "sensitive",
    "sensitivity",
    "sentencepiece",
    "separate",
    "separates",
    "separating",
    "separation",
    "sequence",
    "sequences",
    "sequential",
    "sequentially",
    "serious",
    "serve",
    "server",
    "service",
    "serving",
    "set",
    "sets",
    "settings",
    "setup",
    "several",
    "severely",
    "sft",
    "shape",
    "shaped",
    "shapes",
    "shaping",
    "shard",
    "sharded",
    "sharding",
    "shards",
    "share",
    "shared",
    "shares",
    "sharing",
    "shift",
    "shifts",
    "short",
    "shorten",
    "shorter",
    "shot",
    "should",
    "side",
    "sidebars",
    "signal",
    "signals",
    "signatures",
    "significant",
    "significantly",
    "silent",
    "similar",
    "similarity",
    "similarly",
    "simple",
    "simpler",
    "simplest",
    "simulates",
    "single",
    "sinusoidal",
    "site",
    "sites",
    "situates",
    "size",
    "sizes",
    "slang",
    "slice",
    "slow",
    "small",
    "smaller",
    "smallest",
    "smooth",
    "snippets",
    "so",
    "softmax",
    "solely",
    "solutions",
    "solve",
    "solved",
    "some",
    "sometimes",
    "soon",
    "sophisticated",
    "sounding",
    "source",
    "sources",
    "space",
    "spam",
    "span",
    "spans",
    "sparse",
    "special",
    "specialization",
    "specialized",
    "specific",
    "specify",
    "speculative",
    "speech",
    "speed",
    "speedups",
    "spelling",
    "spikes",
    "split",
    "splits",
    "splitting",
    "square",
    "stability",
    "stabilize",
    "stable",
    "stacked",
    "stacks",
    "stage",
    "stages",
    "stale",
    "standalone",
    "standard",
    "standardized",
    "standardizes",
    "standpoint",
    "start",
    "starting",
    "starts",
    "state",
    "statements",
    "states",
    "static",
    "statistics",
    "statutes",
    "steady",
    "steer",
    "stem",
    "step",
    "steps",
    "stereotyped",
    "still",
    "stochastic",
    "stop",
    "stopping",
    "storage",
    "store",
    "stored",
    "stores",
    "storing",
    "stragglers",
    "straightforward",
    "strategies",
    "strategy",
    "stream",
    "streaming",
    "streams",
    "strengths",
    "stress",
    "strict",
    "stricter",
    "strictly",
    "string",
    "strings",
    "strip",
    "stripping",
    "strong",
    "stronger",
    "strongly",
    "structure",
    "structured",
    "structures",
    "studies",
    "style",
    "styles",
    "stylistic",
    "subjects",
    "subnetworks",
    "subsequent",
    "subset",
    "substantially",
    "substitute",
    "subtle",
    "subword",
    "succeeds",
    "such",
    "suitable",
    "suite",
    "suited",
    "suites",
    "sum",
    "summarization",
    "summarize",
    "summarizes",
    "summarizing",
    "superficial",
    "supervised",
    "supplemented",
    "support",
    "supported",
    "supporting",
    "supports",
    "supposed",
    "surface",
    "surrounding",
    "suspicious",
    "sustain",
    "swapped",
    "symbol",
    "symbols",
    "synchronization",
    "syndicated",
    "syntax",
    "synthetic",
    "synthetically",
    "system",
    "systematic",
    "systems",
    "t",
    "table",
    "tagging",
    "tags",
    "take",
    "takes",
    "target",
    "targeted",
    "targets",
    "task",
    "tasks",
    "teach",
    "teaches",
    "team",
    "teaming",
    "teams",
    "technical",
    "technically",
    "technique",
    "techniques",
    "technology",
    "temperature",
    "temperatures",
    "template",
    "templated",
    "templates",
    "templating",
    "tenant",
    "tends",
    "tensor",
    "tensors",
    "terminology",
    "terms",
    "test",
    "tested",
    "testing",
    "tests",
    "text",
    "texts",
    "than",
    "that",
    "the",
    "their",
    "them",
    "theme",
    "then",
    "theoretical",
    "there",
    "therefore",
    "these",
    "they",
    "thing",
    "think",
    "thinking",
    "third",
    "this",
    "those",
    "though",
    "thought",
    "three",
    "thresholds",
    "through",
    "throughput",
    "tie",
    "tied",
    "tiered",
    "ties",
    "tighten",
    "tighter",
    "tightly",
    "tiling",
    "time",
    "to",
    "together",
    "token",
    "tokenization",
    "tokenize",
    "tokenizer",
    "tokenizers",
    "tokens",
    "tolerance",
    "tone",
    "too",
    "tool",
    "tooling",
    "tools",
    "top",
    "topic",
    "topical",
    "topics",
    "topology",
    "total",
    "toward",
    "trace",
    "traceability",
    "track",
    "tracking",
    "tractable",
    "trade",
    "tradeoff",
    "tradeoffs",
    "trades",
    "traffic",
    "train",
    "trainable",
    "trained",
    "trainers",
    "training",
    "trains",
    "trajectory",
    "transfer",
    "transformation",
    "transformations",
    "transformed",
    "transformer",
    "transformers",
    "translate",
    "translates",
    "translation",
    "transparency",
    "treat",
    "treated",
    "treating",
    "treats",
    "trick",
    "tricked",
    "tricks",
    "trigger",
    "tripling",
    "truncate",
    "trust",
    "trusted",
    "trustworthy",
    "truth",
    "truthful",
    "truthfulness",
    "tunable",
    "tune",
    "tuned",
    "tunes",
    "tuning",
    "turns",
    "tutorial",
    "tutorials",
    "two",
    "tying",
    "type",
    "types",
    "typical",
    "typically",
    "ultimately",
    "uncertain",
    "uncertainty",
    "unchanged",
    "unclear",
    "unconstrained",
    "under",
    "underflow",
    "underlying",
    "underpin",
    "underrepresent",
    "undersampled",
    "understand",
    "understanding",
    "undertrained",
    "underutilized",
    "undesirable",
    "unicode",
    "unigram",
    "unique",
    "uniqueness",
    "unit",
    "units",
    "unless",
    "unlike",
    "unnatural",
    "unnecessary",
    "unpredictably",
    "unrelated",
    "unreliable",
    "unsafe",
    "unstable",
    "unsupported",
    "until",
    "untrained",
    "untrusted",
    "unusual",
    "up",
    "update",
    "updated",
    "updates",
    "updating",
    "usability",
    "usable",
    "usage",
    "use",
    "used",
    "useful",
    "usefulness",
    "user",
    "users",
    "uses",
    "using",
    "usually",
    "utilization",
    "valid",
    "validate",
    "validation",
    "validators",
    "validity",
    "valuable",
    "value",
    "values",
    "variability",
    "variable",
    "variance",
    "variants",
    "variation",
    "varied",
    "vary",
    "varying",
    "vast",
    "vector",
    "vectors",
    "verbosity",
    "verifiable",
    "verification",
    "verify",
    "verifying",
    "versions",
    "versus",
    "very",
    "via",
    "viable",
    "view",
    "viewed",
    "viewing",
    "violate",
    "violation",
    "visible",
    "visualized",
    "vocabularies",
    "vocabulary",
    "vulnerabilities",
    "vulnerability",
    "vulnerable",
    "wall",
    "want",
    "warm",
    "warmup",
    "was",
    "waste",
    "wasted",
    "wasting",
    "way",
    "ways",
    "weaknesses",
    "web",
    "website",
    "weight",
    "weighted",
    "weighting",
    "weights",
    "well",
    "were",
    "what",
    "when",
    "where",
    "whether",
    "which",
    "while",
    "whitespace",
    "whose",
    "why",
    "wide",
    "widely",
    "width",
    "widths",
    "will",
    "win",
    "window",
    "windows",
    "wise",
    "with",
    "within",
    "without",
    "word",
    "wording",
    "words",
    "work",
    "workflow",
    "workflows",
    "workload",
    "workloads",
    "world",
    "worst",
    "would",
    "wrapped",
    "write",
    "writes",
    "writing",
    "written",
    "wrong",
    "wrongdoing",
    "yet",
    "yield",
    "yielding",
    "yields",
    "you",
    "your",
    "zero",
    "–",
    "—",
    "’",
    "“",
    "”"
  ]
}