{
  "vocab": [
    "(",
    ")",
    "+",
    ",",
    "-",
    ".",
    "/",
    "0",
    "1",
    "100",
    "16",
    "2",
    "25",
    "3",
    "4",
    "5",
    "8",
    ":",
    ";",
    "=",
    "?",
    "@",
    "[",
    "]",
    "a",
    "abilities",
    "ability",
    "ablation",
    "able",
    "abnormal",
    "about",
    "abrupt",
    "absence",
    "absent",
    "absolute",
    "absorb",
    "abstain",
    "abstains",
    "abstention",
    "abstract",
    "abstraction",
    "abstractions",
    "academic",
    "accelerate",
    "accelerators",
    "accent",
    "accents",
    "accept",
    "acceptable",
    "acceptance",
    "accepted",
    "accepting",
    "accepts",
    "access",
    "accessibility",
    "accessible",
    "accidental",
    "accidentally",
    "accounting",
    "accumulating",
    "accumulation",
    "accumulators",
    "accuracy",
    "accurate",
    "accurately",
    "achievable",
    "achieve",
    "achieved",
    "acoustic",
    "acquisition",
    "across",
    "act",
    "action",
    "actionable",
    "actions",
    "activate",
    "activated",
    "activates",
    "activating",
    "activation",
    "activations",
    "active",
    "actor",
    "acts",
    "actual",
    "actually",
    "ad",
    "adam",
    "adamw",
    "adapt",
    "adaptability",
    "adaptable",
    "adaptation",
    "adapted",
    "adapter",
    "adapters",
    "adaptive",
    "adapts",
    "add",
    "added",
    "adding",
    "addition",
    "additional",
    "additions",
    "additive",
    "address",
    "addresses",
    "adds",
    "adherence",
    "adjacency",
    "adjacent",
    "adjust",
    "adjusted",
    "adjustment",
    "adjustments",
    "adopt",
    "adopting",
    "advances",
    "advantage",
    "advantages",
    "adversarial",
    "adversarially",
    "advice",
    "affect",
    "affects",
    "afford",
    "affordable",
    "after",
    "afterthought",
    "against",
    "agency",
    "agent",
    "agentic",
    "agents",
    "aggregate",
    "aggregates",
    "aggregating",
    "aggregation",
    "aggressive",
    "aggressively",
    "agnostic",
    "agreement",
    "ai",
    "aim",
    "aimed",
    "aims",
    "alerts",
    "algebraic",
    "algorithm",
    "algorithmic",
    "algorithms",
    "alibi",
    "align",
    "aligned",
    "aligning",
    "alignment",
    "alignments",
    "alike",
    "all",
    "allocate",
    "allocated",
    "allocation",
    "allocations",
    "allow",
    "allowed",
    "allowing",
    "allows",
    "alone",
    "along",
    "alongside",
    "already",
    "also",
    "alter",
    "alternative",
    "alternatives",
    "although",
    "always",
    "ambiguous",
    "among",
    "amortization",
    "amortize",
    "amount",
    "amounts",
    "amplification",
    "amplified",
    "amplify",
    "amplifying",
    "an",
    "analogous",
    "analogy",
    "analyses",
    "analysis",
    "analyze",
    "anchor",
    "anchoring",
    "and",
    "annotation",
    "annotations",
    "anomalous",
    "anomaly",
    "another",
    "answer",
    "answered",
    "answering",
    "answers",
    "anthropomorphic",
    "anthropomorphize",
    "anticipate",
    "any",
    "apart",
    "api",
    "apis",
    "apostrophes",
    "apparent",
    "appeal",
    "appealing",
    "appear",
    "appearance",
    "appeared",
    "appears",
    "application",
    "applications",
    "applied",
    "applies",
    "apply",
    "applying",
    "approach",
    "approached",
    "approaches",
    "appropriate",
    "appropriately",
    "approximate",
    "approximated",
    "approximately",
    "approximations",
    "arbitrarily",
    "arbitrary",
    "architectural",
    "architecture",
    "architectures",
    "are",
    "arguments",
    "arise",
    "arises",
    "arithmetic",
    "around",
    "arrivals",
    "arrive",
    "articles",
    "articulate",
    "articulation",
    "artifact",
    "artifacts",
    "artificial",
    "as",
    "ask",
    "asked",
    "asking",
    "asks",
    "aspects",
    "asr",
    "assembly",
    "assertion",
    "assess",
    "assessment",
    "assessments",
    "asset",
    "assign",
    "assigns",
    "assistance",
    "assistant",
    "assistants",
    "associated",
    "association",
    "associations",
    "assumes",
    "assuming",
    "assumption",
    "assumptions",
    "at",
    "atomic",
    "attack",
    "attacker",
    "attackers",
    "attacks",
    "attainable",
    "attempt",
    "attempting",
    "attempts",
    "attend",
    "attends",
    "attention",
    "attractive",
    "attribute",
    "attributed",
    "attributes",
    "attribution",
    "attributions",
    "audio",
    "audit",
    "auditability",
    "auditable",
    "audited",
    "auditing",
    "audits",
    "augment",
    "augmentation",
    "augmentations",
    "augmented",
    "augmenting",
    "authoritative",
    "auto",
    "automated",
    "automatic",
    "automatically",
    "automl",
    "autoregressive",
    "availability",
    "available",
    "average",
    "averaged",
    "averages",
    "averaging",
    "avoid",
    "avoidance",
    "avoiding",
    "avoids",
    "aware",
    "awareness",
    "axioms",
    "axis",
    "b",
    "back",
    "backbone",
    "backdoors",
    "background",
    "backpressure",
    "backpropagation",
    "backward",
    "balance",
    "balanced",
    "balancing",
    "bandwidth",
    "banners",
    "base",
    "based",
    "baseline",
    "basic",
    "basis",
    "batch",
    "batches",
    "batching",
    "bayesian",
    "be",
    "beam",
    "became",
    "because",
    "become",
    "becomes",
    "becoming",
    "been",
    "before",
    "begin",
    "begins",
    "behave",
    "behaves",
    "behavior",
    "behavioral",
    "behaviors",
    "behind",
    "being",
    "belief",
    "beliefs",
    "believes",
    "bellman",
    "belong",
    "benchmark",
    "benchmarking",
    "benchmarks",
    "beneficial",
    "benefit",
    "benefits",
    "benign",
    "best",
    "better",
    "between",
    "beyond",
    "bf",
    "bfloat",
    "bias",
    "biased",
    "biases",
    "bidirectional",
    "big",
    "bigger",
    "biggest",
    "bind",
    "binding",
    "biomedical",
    "bit",
    "bits",
    "black",
    "blacklist",
    "blandness",
    "blank",
    "blanks",
    "blend",
    "blending",
    "blends",
    "blindly",
    "block",
    "blocked",
    "blocking",
    "blocks",
    "blog",
    "blur",
    "blurred",
    "bm",
    "bn",
    "boilerplate",
    "bookkeeping",
    "books",
    "boosted",
    "boosting",
    "bootstrapped",
    "bootstrapping",
    "border",
    "borderline",
    "borrows",
    "both",
    "bottleneck",
    "bottlenecked",
    "bottlenecks",
    "bound",
    "boundaries",
    "boundary",
    "bounding",
    "bounds",
    "box",
    "boxes",
    "bpe",
    "bracket",
    "branches",
    "branching",
    "breadth",
    "break",
    "breakdown",
    "breaking",
    "bridge",
    "brief",
    "briefly",
    "brings",
    "brittle",
    "broad",
    "broader",
    "broadly",
    "browse",
    "brute",
    "bubbles",
    "budget",
    "budgeting",
    "budgets",
    "buffer",
    "bug",
    "bugs",
    "build",
    "builders",
    "building",
    "builds",
    "built",
    "bulk",
    "bullet",
    "burden",
    "business",
    "busy",
    "but",
    "by",
    "bypass",
    "byte",
    "bytes",
    "cache",
    "cached",
    "caches",
    "caching",
    "calculators",
    "calculus",
    "calibrate",
    "calibrated",
    "calibration",
    "call",
    "called",
    "calling",
    "calls",
    "came",
    "camera",
    "can",
    "cancellation",
    "candidate",
    "candidates",
    "cannot",
    "canonical",
    "capabilities",
    "capability",
    "capable",
    "capacity",
    "capitalization",
    "capture",
    "captures",
    "capturing",
    "card",
    "cards",
    "care",
    "careful",
    "carefully",
    "carried",
    "carriers",
    "carrying",
    "case",
    "cases",
    "casual",
    "catastrophic",
    "categories",
    "category",
    "causal",
    "causality",
    "causally",
    "cause",
    "caused",
    "causing",
    "caution",
    "cautions",
    "cautious",
    "caveat",
    "caveats",
    "cells",
    "central",
    "centralization",
    "centralize",
    "centralized",
    "certain",
    "certainty",
    "chain",
    "chains",
    "challenge",
    "challenged",
    "challenges",
    "challenging",
    "chance",
    "change",
    "changed",
    "changes",
    "changing",
    "channels",
    "character",
    "characteristic",
    "characteristics",
    "characterized",
    "characters",
    "chat",
    "cheap",
    "cheaper",
    "checking",
    "checklist",
    "checkpoint",
    "checkpointing",
    "checkpoints",
    "checks",
    "chinchilla",
    "chip",
    "choice",
    "choices",
    "choose",
    "chooses",
    "choosing",
    "chosen",
    "chrome",
    "chunk",
    "chunking",
    "chunks",
    "churn",
    "circuit",
    "circuits",
    "citation",
    "citations",
    "cite",
    "cited",
    "cites",
    "claim",
    "claims",
    "clarifies",
    "clarify",
    "clarifying",
    "clarity",
    "class",
    "classes",
    "classic",
    "classical",
    "classification",
    "classifier",
    "classifiers",
    "classify",
    "clauses",
    "clean",
    "cleaned",
    "cleaner",
    "cleaning",
    "clear",
    "clearly",
    "clich",
    "client",
    "clients",
    "clinically",
    "clip",
    "clipping",
    "clock",
    "close",
    "closed",
    "closely",
    "cluster",
    "clustering",
    "clusters",
    "coarse",
    "code",
    "codebook",
    "coding",
    "coefficient",
    "coexist",
    "cognition",
    "coherence",
    "coherent",
    "cohort",
    "cohorts",
    "cold",
    "collapse",
    "collapsed",
    "collapses",
    "collect",
    "collected",
    "collecting",
    "collection",
    "collections",
    "collective",
    "collectives",
    "collider",
    "colliders",
    "colluding",
    "column",
    "combination",
    "combinations",
    "combine",
    "combined",
    "combines",
    "combining",
    "come",
    "commands",
    "comment",
    "commitments",
    "common",
    "commonly",
    "communicate",
    "communicated",
    "communication",
    "compact",
    "comparable",
    "comparatively",
    "compare",
    "compared",
    "comparing",
    "comparisons",
    "compensate",
    "compete",
    "competence",
    "competencies",
    "competent",
    "competing",
    "competitive",
    "complement",
    "complementary",
    "complemented",
    "complements",
    "complete",
    "completes",
    "completion",
    "completions",
    "complex",
    "complexity",
    "compliance",
    "compliant",
    "complicates",
    "comply",
    "component",
    "components",
    "composable",
    "composing",
    "composition",
    "compositional",
    "compositionally",
    "compounding",
    "comprehensive",
    "compress",
    "compressed",
    "compresses",
    "compressing",
    "compression",
    "compromise",
    "computation",
    "computational",
    "computations",
    "compute",
    "computed",
    "computes",
    "computing",
    "concatenates",
    "concatenating",
    "concentrate",
    "concept",
    "concepts",
    "conceptual",
    "conceptually",
    "concern",
    "concerned",
    "concerns",
    "concise",
    "conclusion",
    "conclusions",
    "concrete",
    "concurrency",
    "concurrent",
    "concurrently",
    "condition",
    "conditional",
    "conditioned",
    "conditioning",
    "conditions",
    "confidence",
    "confident",
    "confidently",
    "config",
    "configurable",
    "configuration",
    "configurations",
    "confirm",
    "confirmation",
    "conflating",
    "conflict",
    "confounding",
    "confuses",
    "confusing",
    "confusion",
    "connect",
    "connected",
    "connecting",
    "connectionist",
    "connections",
    "connectivity",
    "connects",
    "consequence",
    "consequences",
    "consequently",
    "conservative",
    "consider",
    "considerations",
    "considered",
    "considers",
    "consistency",
    "consistent",
    "consistently",
    "consists",
    "consolidation",
    "constant",
    "constitutional",
    "constrain",
    "constrained",
    "constrains",
    "constraint",
    "constraints",
    "construct",
    "constructed",
    "construction",
    "consume",
    "consumed",
    "consumes",
    "consuming",
    "consumption",
    "contain",
    "contains",
    "contaminated",
    "contamination",
    "contemporary",
    "content",
    "contents",
    "context",
    "contexts",
    "contextual",
    "contiguous",
    "continuation",
    "continuations",
    "continue",
    "continued",
    "continues",
    "continuous",
    "continuously",
    "contract",
    "contracting",
    "contracts",
    "contradict",
    "contradiction",
    "contradictions",
    "contradictory",
    "contrast",
    "contrasting",
    "contrastive",
    "contrasts",
    "contribute",
    "contribution",
    "control",
    "controlled",
    "controller",
    "controlling",
    "controls",
    "conventions",
    "converge",
    "convergence",
    "conversation",
    "conversational",
    "conversely",
    "conversion",
    "convert",
    "converting",
    "converts",
    "conveys",
    "convolution",
    "convolutional",
    "cookie",
    "cooperative",
    "coordinate",
    "copies",
    "copy",
    "copying",
    "copyright",
    "copyrighted",
    "core",
    "coreference",
    "corpora",
    "corpus",
    "correct",
    "correction",
    "corrections",
    "correctly",
    "correctness",
    "corrects",
    "correlate",
    "correlated",
    "correlates",
    "correlation",
    "correlations",
    "correspond",
    "correspondence",
    "corresponding",
    "corresponds",
    "corrupt",
    "corrupted",
    "corruption",
    "cosine",
    "cosmetic",
    "cost",
    "costly",
    "costs",
    "could",
    "count",
    "counteracts",
    "counterexample",
    "counterfactual",
    "counterfactuals",
    "counts",
    "coupled",
    "covariance",
    "cover",
    "coverage",
    "craft",
    "crawl",
    "crawls",
    "create",
    "created",
    "creates",
    "creating",
    "creative",
    "creativity",
    "credit",
    "criteria",
    "criterion",
    "critic",
    "critical",
    "critique",
    "cross",
    "crowd",
    "crucial",
    "ctc",
    "cue",
    "cues",
    "culture",
    "cumulative",
    "curate",
    "curated",
    "curating",
    "curation",
    "curious",
    "current",
    "curriculum",
    "curve",
    "curves",
    "custom",
    "customer",
    "dangerous",
    "dashes",
    "data",
    "database",
    "databases",
    "dataset",
    "datasets",
    "datasheets",
    "date",
    "dates",
    "dead",
    "debate",
    "debug",
    "debugging",
    "decay",
    "deceptively",
    "decide",
    "decided",
    "decides",
    "decision",
    "decisions",
    "decisive",
    "decline",
    "decoder",
    "decoders",
    "decoding",
    "decomposition",
    "decontamination",
    "decorative",
    "decoupled",
    "decoupling",
    "decrease",
    "decreases",
    "decreasing",
    "deduction",
    "deduplicate",
    "deduplicated",
    "deduplication",
    "deep",
    "deeper",
    "default",
    "defense",
    "defenses",
    "defer",
    "deferral",
    "define",
    "defined",
    "defines",
    "defining",
    "definition",
    "definitions",
    "definitive",
    "degradation",
    "degrade",
    "degrades",
    "degree",
    "degrees",
    "delay",
    "delayed",
    "deletable",
    "deliberate",
    "deliberately",
    "deliberation",
    "deliberative",
    "delicate",
    "deliver",
    "delivers",
    "demand",
    "demographic",
    "demonstrations",
    "denoised",
    "denoises",
    "denoising",
    "dense",
    "density",
    "departure",
    "depend",
    "dependence",
    "dependencies",
    "dependency",
    "dependent",
    "depending",
    "depends",
    "deploy",
    "deployed",
    "deploying",
    "deployment",
    "deployments",
    "depth",
    "derived",
    "describe",
    "described",
    "describes",
    "describing",
    "description",
    "descriptions",
    "design",
    "designed",
    "designing",
    "designs",
    "desirable",
    "desired",
    "destabilize",
    "destroy",
    "destructive",
    "detail",
    "detailed",
    "details",
    "detect",
    "detected",
    "detecting",
    "detection",
    "detections",
    "detectors",
    "determine",
    "determines",
    "determinism",
    "deterministic",
    "deterministically",
    "detokenization",
    "developer",
    "developers",
    "development",
    "device",
    "devices",
    "diagnose",
    "diagnosing",
    "diagnostic",
    "diagnostics",
    "diagram",
    "diagrams",
    "dialog",
    "dice",
    "did",
    "didactic",
    "differ",
    "difference",
    "differences",
    "different",
    "differential",
    "differentiates",
    "differently",
    "differs",
    "difficult",
    "difficulty",
    "diffuse",
    "diffusion",
    "dimension",
    "dimensional",
    "dimensionality",
    "dimensions",
    "diminish",
    "direct",
    "directed",
    "directions",
    "directives",
    "directly",
    "disagree",
    "disagreement",
    "disallowed",
    "disappear",
    "discard",
    "discarding",
    "discipline",
    "disciplined",
    "disclosing",
    "disconnect",
    "disconnected",
    "discount",
    "discourage",
    "discourse",
    "discover",
    "discrete",
    "discriminative",
    "discuss",
    "discussed",
    "discussion",
    "discussions",
    "disproportionately",
    "distance",
    "distillation",
    "distilled",
    "distills",
    "distinct",
    "distinction",
    "distinctions",
    "distinctive",
    "distinguish",
    "distinguishes",
    "distinguishing",
    "distort",
    "distraction",
    "distractive",
    "distractor",
    "distractors",
    "distribute",
    "distributed",
    "distributeddataparallel",
    "distribution",
    "distributional",
    "distributions",
    "distrust",
    "diverge",
    "divergence",
    "diverse",
    "diversity",
    "do",
    "document",
    "documentation",
    "documented",
    "documenting",
    "documents",
    "does",
    "doing",
    "dolma",
    "domain",
    "domains",
    "dominant",
    "dominate",
    "dominated",
    "dominates",
    "dominating",
    "don",
    "done",
    "dot",
    "doubling",
    "downside",
    "downstream",
    "dozen",
    "dp",
    "dpo",
    "draft",
    "drafts",
    "dramatic",
    "dramatically",
    "drastically",
    "drawn",
    "drift",
    "drive",
    "driven",
    "driver",
    "drop",
    "dropout",
    "due",
    "duplicate",
    "duplicated",
    "duplicates",
    "duplicating",
    "duplication",
    "duration",
    "during",
    "dynamic",
    "dynamical",
    "dynamically",
    "dynamics",
    "e",
    "each",
    "earlier",
    "early",
    "easier",
    "easily",
    "easy",
    "economically",
    "economics",
    "ecosystem",
    "edge",
    "edges",
    "edited",
    "edits",
    "educational",
    "effect",
    "effective",
    "effectively",
    "effectiveness",
    "effects",
    "efficiency",
    "efficient",
    "efficiently",
    "effort",
    "efforts",
    "either",
    "elements",
    "elicit",
    "eliciting",
    "eligible",
    "else",
    "elsewhere",
    "emails",
    "embed",
    "embedded",
    "embedding",
    "embeddings",
    "embeds",
    "emergence",
    "emergent",
    "emerges",
    "emit",
    "emphasize",
    "emphasizes",
    "emphasizing",
    "empirical",
    "empirically",
    "enable",
    "enables",
    "enabling",
    "encode",
    "encoded",
    "encoder",
    "encodes",
    "encoding",
    "encodings",
    "encourage",
    "encouraged",
    "encourages",
    "encouraging",
    "encyclopedia",
    "end",
    "ended",
    "enforce",
    "enforced",
    "enforcement",
    "enforces",
    "enforcing",
    "engine",
    "engineered",
    "engineering",
    "engineers",
    "english",
    "enormous",
    "enough",
    "ensemble",
    "ensembling",
    "ensure",
    "ensures",
    "entailment",
    "entangled",
    "enterprise",
    "entire",
    "entities",
    "entity",
    "entropy",
    "entry",
    "enumerating",
    "environment",
    "environmental",
    "environments",
    "episode",
    "epistemic",
    "equal",
    "equality",
    "equalized",
    "equally",
    "equation",
    "equations",
    "equivalent",
    "equivariances",
    "error",
    "errors",
    "escalate",
    "especially",
    "essay",
    "essays",
    "essential",
    "establishes",
    "estimable",
    "estimate",
    "estimates",
    "estimating",
    "estimation",
    "estimators",
    "etc",
    "ethical",
    "etl",
    "evaluate",
    "evaluated",
    "evaluating",
    "evaluation",
    "evaluations",
    "evaluator",
    "even",
    "events",
    "every",
    "everything",
    "evidence",
    "evolves",
    "exact",
    "exactly",
    "exactness",
    "examine",
    "example",
    "examples",
    "exceed",
    "exceeds",
    "excel",
    "except",
    "excessive",
    "exclude",
    "excluded",
    "executed",
    "executes",
    "executing",
    "execution",
    "exemplifies",
    "exfiltration",
    "exhausted",
    "exist",
    "existence",
    "existing",
    "exists",
    "expanding",
    "expansion",
    "expect",
    "expectations",
    "expected",
    "expensive",
    "experience",
    "experiential",
    "experiment",
    "experimental",
    "experimentation",
    "experiments",
    "expert",
    "experts",
    "explain",
    "explained",
    "explaining",
    "explains",
    "explanation",
    "explanations",
    "explanatory",
    "explicit",
    "explicitly",
    "exploding",
    "exploit",
    "exploitation",
    "exploited",
    "exploits",
    "exploration",
    "explore",
    "explores",
    "expose",
    "exposing",
    "exposition",
    "exposure",
    "express",
    "expressed",
    "expresses",
    "expression",
    "expressions",
    "extend",
    "extended",
    "extending",
    "extends",
    "extension",
    "extensions",
    "external",
    "externality",
    "externalizes",
    "extra",
    "extract",
    "extracted",
    "extracting",
    "extraction",
    "extrapolation",
    "extremely",
    "extrinsic",
    "f",
    "fabricated",
    "face",
    "facing",
    "fact",
    "factor",
    "factorizes",
    "factors",
    "facts",
    "factual",
    "factuality",
    "faculties",
    "fail",
    "failing",
    "fails",
    "failure",
    "failures",
    "fairness",
    "faithful",
    "faithfulness",
    "fall",
    "fallback",
    "false",
    "falsify",
    "families",
    "family",
    "far",
    "fast",
    "faster",
    "fastest",
    "fault",
    "favors",
    "feasibility",
    "feasible",
    "feature",
    "features",
    "fedavg",
    "federated",
    "feed",
    "feedback",
    "feels",
    "few",
    "fewer",
    "fid",
    "field",
    "fields",
    "figurative",
    "figures",
    "file",
    "files",
    "filter",
    "filtered",
    "filtering",
    "filters",
    "final",
    "finally",
    "finance",
    "find",
    "finding",
    "findings",
    "finds",
    "fine",
    "finetune",
    "finetuning",
    "fineweb",
    "finished",
    "finite",
    "fire",
    "first",
    "fit",
    "fits",
    "fitting",
    "fixed",
    "fixing",
    "flag",
    "flashattention",
    "flattening",
    "flexibility",
    "flexible",
    "flip",
    "flips",
    "float",
    "floating",
    "flops",
    "flow",
    "flows",
    "fluency",
    "fluent",
    "fluid",
    "focal",
    "focus",
    "focused",
    "focuses",
    "focusing",
    "follow",
    "followed",
    "following",
    "follows",
    "foolproof",
    "footers",
    "footnote",
    "footprint",
    "for",
    "force",
    "forces",
    "forcing",
    "forgetting",
    "form",
    "formal",
    "formalize",
    "format",
    "formats",
    "formatted",
    "formatting",
    "formed",
    "former",
    "forming",
    "forms",
    "formulation",
    "formulations",
    "forums",
    "forward",
    "found",
    "foundation",
    "foundational",
    "four",
    "fp",
    "fraction",
    "fragile",
    "fragility",
    "fragmentation",
    "fragmented",
    "fragments",
    "frame",
    "framed",
    "frames",
    "framework",
    "frameworks",
    "framing",
    "free",
    "freeze",
    "freezing",
    "frequencies",
    "frequency",
    "frequent",
    "frequently",
    "freshness",
    "friendly",
    "from",
    "front",
    "frontier",
    "frozen",
    "fsdp",
    "full",
    "fully",
    "function",
    "functional",
    "functions",
    "fundamental",
    "fundamentals",
    "furniture",
    "further",
    "fuse",
    "fusing",
    "fusion",
    "future",
    "fuzzy",
    "g",
    "gain",
    "gains",
    "game",
    "gap",
    "gather",
    "gathering",
    "gathers",
    "gating",
    "gaussian",
    "gcn",
    "gcns",
    "general",
    "generalization",
    "generalize",
    "generally",
    "generate",
    "generated",
    "generates",
    "generating",
    "generation",
    "generations",
    "generative",
    "generator",
    "generic",
    "genre",
    "genres",
    "genuine",
    "genuinely",
    "geometry",
    "get",
    "give",
    "given",
    "gives",
    "giving",
    "global",
    "globally",
    "glossary",
    "glyphs",
    "go",
    "goal",
    "goals",
    "good",
    "governance",
    "gpu",
    "gpus",
    "gqa",
    "gracefully",
    "gradient",
    "gradients",
    "gradual",
    "gradually",
    "grained",
    "gram",
    "grammatical",
    "graph",
    "graphs",
    "greatly",
    "greedy",
    "grid",
    "ground",
    "grounded",
    "grounding",
    "group",
    "grouped",
    "grouping",
    "groupnorm",
    "groups",
    "grow",
    "grows",
    "growth",
    "guarantee",
    "guaranteed",
    "guaranteeing",
    "guarantees",
    "guardrails",
    "guess",
    "guesses",
    "guessing",
    "guidance",
    "guide",
    "guides",
    "guiding",
    "h",
    "habits",
    "hacking",
    "hallmark",
    "hallucinate",
    "hallucination",
    "hallucinations",
    "hand",
    "handle",
    "handled",
    "handles",
    "handling",
    "happen",
    "happened",
    "hard",
    "harder",
    "hardware",
    "harm",
    "harmful",
    "harming",
    "harmlessness",
    "has",
    "hashing",
    "hate",
    "hausdorff",
    "have",
    "having",
    "head",
    "headers",
    "headings",
    "headline",
    "heads",
    "health",
    "healthcare",
    "heavily",
    "heavy",
    "held",
    "helm",
    "help",
    "helpful",
    "helpfulness",
    "helps",
    "heterogeneity",
    "heterogeneous",
    "heuristic",
    "heuristics",
    "hidden",
    "hide",
    "hides",
    "hierarchy",
    "high",
    "higher",
    "highest",
    "highlight",
    "highlighting",
    "highlights",
    "highly",
    "historical",
    "historically",
    "history",
    "hit",
    "hoc",
    "hold",
    "holding",
    "holds",
    "holistic",
    "homophilous",
    "honesty",
    "hooks",
    "horizon",
    "host",
    "how",
    "however",
    "html",
    "huge",
    "human",
    "humanities",
    "hybrid",
    "hybrids",
    "hygiene",
    "hyperparameter",
    "hyperparameters",
    "hypotheses",
    "hypothesis",
    "hypothetical",
    "i",
    "idea",
    "ideas",
    "identical",
    "identifiability",
    "identification",
    "identified",
    "identifier",
    "identifiers",
    "identify",
    "identifying",
    "identity",
    "idiosyncrasies",
    "ids",
    "if",
    "ignore",
    "ignores",
    "ignoring",
    "iid",
    "illusion",
    "illustrate",
    "illustrates",
    "image",
    "imagenet",
    "imagery",
    "images",
    "imbalance",
    "imbalanced",
    "impact",
    "impacted",
    "impactful",
    "impacts",
    "imperceptible",
    "imperfect",
    "imperfectly",
    "implement",
    "implementation",
    "implementations",
    "implemented",
    "implementing",
    "implements",
    "implication",
    "implications",
    "implicit",
    "implicitly",
    "implied",
    "implies",
    "imply",
    "implying",
    "importance",
    "important",
    "importantly",
    "imposed",
    "impossible",
    "impression",
    "improve",
    "improved",
    "improvement",
    "improvements",
    "improves",
    "improving",
    "improvise",
    "in",
    "inadvertently",
    "incidents",
    "include",
    "included",
    "includes",
    "including",
    "inclusion",
    "incompatible",
    "inconsistencies",
    "inconsistency",
    "inconsistent",
    "incorporate",
    "incorporates",
    "incorporating",
    "incorrect",
    "incorrectly",
    "increase",
    "increases",
    "increasing",
    "increasingly",
    "increment",
    "incremental",
    "incur",
    "indentation",
    "independence",
    "independent",
    "index",
    "indexed",
    "indexing",
    "indicate",
    "indicates",
    "indicators",
    "indirectly",
    "indiscriminately",
    "indistinguishable",
    "individual",
    "individually",
    "individuals",
    "induce",
    "induced",
    "inducing",
    "induction",
    "inductive",
    "industrial",
    "inefficient",
    "inefficiently",
    "inference",
    "inferred",
    "inferring",
    "infers",
    "inflate",
    "inflated",
    "influence",
    "influenced",
    "influences",
    "influential",
    "infonce",
    "inform",
    "informal",
    "information",
    "informed",
    "informs",
    "infrastructure",
    "ingest",
    "ingestion",
    "inherit",
    "initial",
    "initialization",
    "inject",
    "injected",
    "injecting",
    "injection",
    "injects",
    "input",
    "inputs",
    "inquiries",
    "insert",
    "inserted",
    "inserts",
    "inside",
    "insight",
    "insofar",
    "inspect",
    "inspection",
    "inspired",
    "instabilities",
    "instability",
    "instance",
    "instances",
    "instead",
    "instruction",
    "instructions",
    "instructive",
    "instrument",
    "insufficient",
    "int",
    "intact",
    "integrate",
    "integrated",
    "integrating",
    "integration",
    "integrity",
    "intelligence",
    "intended",
    "intends",
    "intensive",
    "intent",
    "intention",
    "intentionally",
    "intentions",
    "intents",
    "interact",
    "interacting",
    "interaction",
    "interactions",
    "interactive",
    "interacts",
    "interconnect",
    "interface",
    "interfaces",
    "interference",
    "intermediate",
    "intermediates",
    "intermittent",
    "intermittently",
    "internal",
    "internalize",
    "internally",
    "interplay",
    "interpolates",
    "interpolation",
    "interpret",
    "interpretability",
    "interpretable",
    "interpretation",
    "interpreted",
    "intersection",
    "intervals",
    "intervenable",
    "intervention",
    "interventional",
    "interventions",
    "into",
    "intrinsic",
    "introduce",
    "introduced",
    "introduces",
    "introducing",
    "introduction",
    "introductions",
    "intuition",
    "intuitive",
    "intuitively",
    "invalid",
    "invalidate",
    "invalidation",
    "invariance",
    "invariances",
    "invariant",
    "invent",
    "invented",
    "invest",
    "invisible",
    "invocation",
    "involve",
    "involves",
    "io",
    "iou",
    "irrelevant",
    "is",
    "isolate",
    "isolation",
    "issue",
    "issues",
    "it",
    "items",
    "iterate",
    "iteration",
    "iterations",
    "iterative",
    "iteratively",
    "its",
    "itself",
    "jailbreaks",
    "jointly",
    "json",
    "jsonl",
    "judgment",
    "judgments",
    "just",
    "justification",
    "justifications",
    "k",
    "kalman",
    "keep",
    "keeping",
    "keeps",
    "kernel",
    "kernels",
    "key",
    "keys",
    "keywords",
    "kind",
    "kinds",
    "kl",
    "knobs",
    "know",
    "knowing",
    "knowledge",
    "known",
    "knows",
    "kv",
    "label",
    "labeled",
    "labeling",
    "labels",
    "lack",
    "lacks",
    "landscape",
    "language",
    "languages",
    "laplace",
    "large",
    "larger",
    "last",
    "late",
    "latency",
    "latent",
    "later",
    "latter",
    "law",
    "laws",
    "layer",
    "layered",
    "layernorm",
    "layers",
    "layout",
    "layouts",
    "lead",
    "leaderboard",
    "leading",
    "leads",
    "leak",
    "leakage",
    "leaked",
    "leaking",
    "learn",
    "learned",
    "learner",
    "learning",
    "learns",
    "least",
    "leaves",
    "led",
    "left",
    "legal",
    "legally",
    "legitimate",
    "length",
    "lengths",
    "lens",
    "less",
    "lesson",
    "lets",
    "level",
    "levels",
    "leverage",
    "leverages",
    "lexical",
    "library",
    "licensing",
    "lifecycle",
    "lighter",
    "lighting",
    "lightly",
    "lightweight",
    "like",
    "likelihood",
    "likelihoods",
    "likely",
    "lime",
    "limit",
    "limitation",
    "limitations",
    "limited",
    "limiting",
    "limits",
    "line",
    "linear",
    "linearity",
    "linguistic",
    "linguistics",
    "links",
    "list",
    "lists",
    "literal",
    "literate",
    "little",
    "live",
    "llm",
    "llms",
    "lm",
    "load",
    "loaded",
    "local",
    "locality",
    "localization",
    "localized",
    "locally",
    "log",
    "logged",
    "logging",
    "logic",
    "logical",
    "logits",
    "logs",
    "long",
    "longer",
    "look",
    "looks",
    "lookup",
    "loop",
    "loops",
    "lora",
    "lose",
    "loses",
    "losing",
    "loss",
    "losses",
    "lossless",
    "lost",
    "low",
    "lower",
    "lowering",
    "lowers",
    "lsh",
    "luxury",
    "macro",
    "made",
    "magic",
    "magnitude",
    "magnitudes",
    "main",
    "maintain",
    "maintained",
    "maintaining",
    "maintains",
    "major",
    "make",
    "makes",
    "making",
    "malicious",
    "manage",
    "managed",
    "management",
    "managers",
    "managing",
    "manifest",
    "manipulable",
    "manipulating",
    "manual",
    "many",
    "map",
    "mapping",
    "mappings",
    "maps",
    "marginal",
    "marginalizes",
    "mark",
    "marker",
    "markers",
    "marketing",
    "markov",
    "markup",
    "mask",
    "masked",
    "masking",
    "masks",
    "mass",
    "massive",
    "mastery",
    "match",
    "matched",
    "matches",
    "matching",
    "material",
    "materialize",
    "materialized",
    "materializes",
    "materially",
    "math",
    "mathematical",
    "matrices",
    "matrix",
    "matter",
    "matters",
    "mature",
    "max",
    "maximal",
    "maximization",
    "maximize",
    "maximizes",
    "maximizing",
    "maximum",
    "may",
    "mdps",
    "mean",
    "meaning",
    "meaningful",
    "means",
    "measurable",
    "measure",
    "measured",
    "measurement",
    "measurements",
    "measures",
    "measuring",
    "mechanics",
    "mechanism",
    "mechanisms",
    "mechanistic",
    "mechanistically",
    "mediate",
    "mediators",
    "medical",
    "meets",
    "membership",
    "memorization",
    "memorize",
    "memorized",
    "memorizes",
    "memorizing",
    "memory",
    "mental",
    "mention",
    "menus",
    "merely",
    "merge",
    "merges",
    "merging",
    "message",
    "messy",
    "metadata",
    "metaphor",
    "metaphorical",
    "metaphors",
    "method",
    "methods",
    "metric",
    "metrics",
    "micro",
    "microphone",
    "mid",
    "middle",
    "might",
    "mind",
    "mindset",
    "minhash",
    "mini",
    "miniature",
    "minimal",
    "minimization",
    "minimizes",
    "minimum",
    "minor",
    "minority",
    "mirror",
    "mirrored",
    "mirrors",
    "misalignment",
    "misclassify",
    "misinformation",
    "misinterpret",
    "mislead",
    "misleading",
    "mismatch",
    "mismatched",
    "misprice",
    "misrepresentation",
    "misrepresents",
    "miss",
    "misses",
    "missing",
    "mistake",
    "mistaken",
    "misunderstand",
    "misuse",
    "misused",
    "mitigating",
    "mitigation",
    "mitigations",
    "mix",
    "mixed",
    "mixes",
    "mixing",
    "mixture",
    "mixtures",
    "ml",
    "mlops",
    "mmlu",
    "mobile",
    "modality",
    "mode",
    "model",
    "modeled",
    "modeling",
    "models",
    "moderate",
    "moderation",
    "modern",
    "modes",
    "modest",
    "modified",
    "modifies",
    "modify",
    "modifying",
    "modular",
    "modularity",
    "module",
    "modules",
    "moe",
    "molecules",
    "moment",
    "moments",
    "monitor",
    "monitored",
    "monitoring",
    "monolingual",
    "monopolizing",
    "more",
    "moreover",
    "morphological",
    "morphology",
    "most",
    "mostly",
    "motivate",
    "motivated",
    "motivates",
    "motivation",
    "motivations",
    "movement",
    "moving",
    "much",
    "multi",
    "multidimensional",
    "multilingual",
    "multiple",
    "multiplication",
    "multiplications",
    "multiply",
    "multiplying",
    "multitask",
    "must",
    "mysterious",
    "n",
    "naive",
    "naively",
    "name",
    "named",
    "names",
    "narrative",
    "narratives",
    "narrow",
    "narrower",
    "nas",
    "natural",
    "naturally",
    "nature",
    "navigation",
    "near",
    "nearby",
    "nearest",
    "necessarily",
    "necessary",
    "necessitating",
    "need",
    "needed",
    "needing",
    "needs",
    "negated",
    "negation",
    "negative",
    "negatives",
    "neighbor",
    "neighborhood",
    "neighborhoods",
    "neighbors",
    "neither",
    "nested",
    "net",
    "nets",
    "network",
    "networks",
    "neural",
    "neuron",
    "neutralizing",
    "never",
    "new",
    "newer",
    "next",
    "nlp",
    "nms",
    "no",
    "node",
    "nodes",
    "noise",
    "noisier",
    "noising",
    "noisy",
    "non",
    "nondeterminism",
    "nonetheless",
    "nonlinear",
    "nonlinearity",
    "nor",
    "norm",
    "normal",
    "normalization",
    "normalize",
    "normalized",
    "normalizing",
    "norms",
    "not",
    "notation",
    "note",
    "notes",
    "notion",
    "noun",
    "nouns",
    "novel",
    "novelty",
    "now",
    "nuance",
    "nuanced",
    "nucleus",
    "nuisance",
    "number",
    "numbers",
    "numeric",
    "numerical",
    "object",
    "objective",
    "objectives",
    "objects",
    "obscure",
    "obscurity",
    "observability",
    "observation",
    "observational",
    "observations",
    "observe",
    "observed",
    "observing",
    "obtained",
    "occlusion",
    "occur",
    "occurrence",
    "occurs",
    "ocr",
    "odds",
    "of",
    "off",
    "offers",
    "offline",
    "offs",
    "often",
    "omission",
    "omit",
    "on",
    "once",
    "one",
    "ones",
    "ongoing",
    "online",
    "only",
    "ontology",
    "oov",
    "opaque",
    "open",
    "opening",
    "operate",
    "operates",
    "operating",
    "operation",
    "operational",
    "operationalize",
    "operationally",
    "operations",
    "operator",
    "operators",
    "opportunities",
    "opportunity",
    "opt",
    "optimal",
    "optimization",
    "optimizations",
    "optimize",
    "optimized",
    "optimizer",
    "optimizers",
    "optimizes",
    "optimizing",
    "optimum",
    "option",
    "optionally",
    "options",
    "or",
    "orchestrates",
    "orchestration",
    "orchestrator",
    "order",
    "ordering",
    "orders",
    "ordinary",
    "organization",
    "organizations",
    "oriented",
    "original",
    "other",
    "others",
    "otherwise",
    "out",
    "outcome",
    "outcomes",
    "outdated",
    "outlier",
    "outliers",
    "outline",
    "outperform",
    "output",
    "outputs",
    "outright",
    "outside",
    "over",
    "overall",
    "overconfident",
    "overfit",
    "overfits",
    "overfitting",
    "overflow",
    "overhead",
    "overlap",
    "overlapped",
    "overlapping",
    "overlaps",
    "overloaded",
    "overly",
    "override",
    "oversampled",
    "oversimplified",
    "oversmooth",
    "overstating",
    "overtrust",
    "overuse",
    "overuses",
    "own",
    "p",
    "pack",
    "packaging",
    "packing",
    "padding",
    "page",
    "paged",
    "pagedattention",
    "pages",
    "paging",
    "pair",
    "paired",
    "pairs",
    "pairwise",
    "paper",
    "papers",
    "paragraph",
    "paragraphs",
    "parallel",
    "parallelism",
    "parameter",
    "parameterization",
    "parameterized",
    "parameters",
    "parametric",
    "paraphrase",
    "paraphrases",
    "parents",
    "parsers",
    "parsing",
    "part",
    "partial",
    "partially",
    "participates",
    "particular",
    "particularly",
    "partitioning",
    "partitions",
    "parts",
    "pass",
    "passage",
    "passages",
    "passes",
    "passing",
    "passive",
    "past",
    "patchability",
    "patching",
    "path",
    "pathological",
    "paths",
    "pattern",
    "patterns",
    "pause",
    "pay",
    "paying",
    "peak",
    "pedagogical",
    "pedagogy",
    "peeking",
    "peft",
    "penalize",
    "penalized",
    "penalizing",
    "penalties",
    "penalty",
    "people",
    "per",
    "perceive",
    "perceived",
    "percentiles",
    "perception",
    "perceptual",
    "perform",
    "performance",
    "performed",
    "performs",
    "periodic",
    "permission",
    "permissioning",
    "permissions",
    "permissive",
    "permutation",
    "perplexity",
    "persist",
    "persistence",
    "persistent",
    "person",
    "personal",
    "personalization",
    "perspective",
    "perspectives",
    "persuasive",
    "perturbation",
    "perturbations",
    "perturbed",
    "phantom",
    "phase",
    "phases",
    "phenomena",
    "phenomenon",
    "philosophy",
    "phone",
    "phrase",
    "phrases",
    "phrasing",
    "pick",
    "picture",
    "pieces",
    "pile",
    "pillar",
    "pipeline",
    "pipelines",
    "pitfall",
    "pitfalls",
    "pixel",
    "pixels",
    "place",
    "placement",
    "plan",
    "planning",
    "platforms",
    "plausibility",
    "plausible",
    "plays",
    "plentiful",
    "plenty",
    "plural",
    "plus",
    "point",
    "points",
    "poison",
    "poisoning",
    "policies",
    "policy",
    "poor",
    "poorly",
    "popular",
    "popularized",
    "position",
    "positional",
    "positions",
    "positive",
    "positives",
    "possess",
    "possibility",
    "possible",
    "post",
    "posterior",
    "posts",
    "potential",
    "potentially",
    "power",
    "powerful",
    "ppo",
    "practical",
    "practice",
    "practices",
    "practitioners",
    "pragmatic",
    "pre",
    "precise",
    "precision",
    "precompute",
    "predict",
    "predictable",
    "predicted",
    "predicting",
    "prediction",
    "predictions",
    "predictive",
    "predictor",
    "predictors",
    "predicts",
    "prefer",
    "preference",
    "preferences",
    "preferred",
    "prefix",
    "prefixes",
    "premises",
    "premium",
    "preparation",
    "preprocessing",
    "prerequisite",
    "present",
    "presented",
    "preservation",
    "preserve",
    "preserved",
    "preserves",
    "preserving",
    "pressure",
    "pressures",
    "pretext",
    "pretrain",
    "pretrained",
    "pretraining",
    "prevent",
    "prevents",
    "previous",
    "pricing",
    "primarily",
    "primary",
    "primitive",
    "primitives",
    "principle",
    "principled",
    "principles",
    "prior",
    "priorities",
    "prioritize",
    "prioritizing",
    "priority",
    "privacy",
    "private",
    "probabilistic",
    "probabilities",
    "probability",
    "probable",
    "probe",
    "probes",
    "problem",
    "problems",
    "procedure",
    "procedures",
    "proceeds",
    "process",
    "processed",
    "processes",
    "processing",
    "produce",
    "produced",
    "produces",
    "producing",
    "product",
    "production",
    "products",
    "professional",
    "profile",
    "profiling",
    "programming",
    "progressively",
    "project",
    "projection",
    "projections",
    "projects",
    "prominent",
    "promise",
    "prompt",
    "prompted",
    "prompting",
    "promptly",
    "prompts",
    "proof",
    "propagate",
    "propagated",
    "propagates",
    "propagating",
    "proper",
    "properly",
    "properties",
    "property",
    "proportional",
    "proposal",
    "proposals",
    "propose",
    "proposed",
    "proposes",
    "proposing",
    "proprietary",
    "prose",
    "protected",
    "protections",
    "protects",
    "protocol",
    "protocols",
    "prove",
    "provenance",
    "provide",
    "provided",
    "provides",
    "providing",
    "proxies",
    "proximal",
    "proximity",
    "proxy",
    "public",
    "publicly",
    "publish",
    "punctuation",
    "pure",
    "purely",
    "purpose",
    "pushed",
    "pushing",
    "puzzles",
    "pytorch",
    "qa",
    "qlora",
    "quadratic",
    "qualification",
    "qualified",
    "qualify",
    "qualitative",
    "quality",
    "quantification",
    "quantifiers",
    "quantify",
    "quantifying",
    "quantile",
    "quantitatively",
    "quantities",
    "quantization",
    "quantized",
    "quantizing",
    "queries",
    "query",
    "question",
    "questions",
    "queueing",
    "quick",
    "quickly",
    "quirks",
    "rag",
    "raise",
    "raises",
    "random",
    "randomized",
    "randomly",
    "randomness",
    "range",
    "ranges",
    "ranging",
    "rank",
    "ranking",
    "rankings",
    "rapid",
    "rare",
    "rarely",
    "rate",
    "rates",
    "rather",
    "ratings",
    "rationalizations",
    "raw",
    "re",
    "reach",
    "reaching",
    "reactive",
    "read",
    "readable",
    "reading",
    "reads",
    "ready",
    "real",
    "realistic",
    "realities",
    "reality",
    "reason",
    "reasoner",
    "reasoning",
    "reasons",
    "rebalance",
    "recall",
    "recalls",
    "receive",
    "receiving",
    "recency",
    "recent",
    "receptive",
    "recipe",
    "recipes",
    "recognition",
    "recognizing",
    "recombination",
    "recommendation",
    "recommender",
    "recomputation",
    "recompute",
    "recomputed",
    "recomputes",
    "recomputing",
    "reconstruct",
    "reconstructing",
    "reconstruction",
    "record",
    "recording",
    "recordings",
    "records",
    "recover",
    "recurrent",
    "recurring",
    "red",
    "redaction",
    "reduce",
    "reduced",
    "reduces",
    "reducing",
    "reduction",
    "redundancy",
    "redundant",
    "reference",
    "references",
    "refers",
    "refine",
    "refinedweb",
    "reflect",
    "reflecting",
    "reflections",
    "reflects",
    "reframe",
    "reframes",
    "refresh",
    "refusal",
    "refusals",
    "refuse",
    "refuses",
    "regardless",
    "regime",
    "regimes",
    "region",
    "regions",
    "regression",
    "regressions",
    "regularities",
    "regularization",
    "regulatory",
    "reinforce",
    "reinforcement",
    "reinforcing",
    "reject",
    "rejected",
    "rejecting",
    "related",
    "relation",
    "relational",
    "relations",
    "relationship",
    "relationships",
    "relative",
    "relatively",
    "release",
    "relevance",
    "relevant",
    "reliability",
    "reliable",
    "reliably",
    "reliance",
    "relies",
    "rely",
    "relying",
    "remain",
    "remaining",
    "remains",
    "remediate",
    "remedy",
    "remembering",
    "remembers",
    "removal",
    "remove",
    "removed",
    "removes",
    "removing",
    "reorder",
    "reorganizes",
    "repeat",
    "repeatable",
    "repeated",
    "repeatedly",
    "repeats",
    "repetition",
    "repetitive",
    "replace",
    "replaced",
    "replaces",
    "replicates",
    "report",
    "reported",
    "reporting",
    "reports",
    "repositories",
    "represent",
    "representation",
    "representational",
    "representationally",
    "representations",
    "representative",
    "represented",
    "representing",
    "represents",
    "reproduce",
    "reproduced",
    "reproducibility",
    "reproducible",
    "reproduction",
    "request",
    "requested",
    "requesting",
    "requests",
    "require",
    "required",
    "requirement",
    "requirements",
    "requires",
    "requiring",
    "rescales",
    "research",
    "researchers",
    "resemblance",
    "resemble",
    "resembles",
    "reservation",
    "reserved",
    "reserving",
    "reshape",
    "reshaped",
    "reshapes",
    "resharding",
    "residual",
    "residue",
    "resilience",
    "resolution",
    "resolutions",
    "resolve",
    "resource",
    "resources",
    "respect",
    "respected",
    "respects",
    "respond",
    "response",
    "responses",
    "responsible",
    "responsibly",
    "responsiveness",
    "restart",
    "restarting",
    "restores",
    "restricts",
    "restructure",
    "restructuring",
    "result",
    "resulting",
    "results",
    "resume",
    "retaining",
    "retains",
    "retention",
    "retraining",
    "retrieval",
    "retrieve",
    "retrieved",
    "retrieves",
    "retrospectively",
    "retry",
    "return",
    "returned",
    "returns",
    "reusable",
    "reuse",
    "reused",
    "reusing",
    "reveal",
    "revealing",
    "reveals",
    "reverberation",
    "reversal",
    "reverse",
    "review",
    "reviewed",
    "reviews",
    "revise",
    "revising",
    "revision",
    "revisit",
    "reward",
    "rewarded",
    "rewarding",
    "rewards",
    "reweight",
    "rewrite",
    "rewriting",
    "rich",
    "richer",
    "right",
    "rights",
    "rigor",
    "rigorous",
    "rise",
    "risk",
    "risks",
    "risky",
    "rival",
    "rl",
    "rlhf",
    "robotics",
    "robust",
    "robustness",
    "role",
    "roleplay",
    "roles",
    "rolling",
    "rope",
    "rotary",
